cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
        <register>
          <name>CLK_SELECT</name>
          <description>Clock Select Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFF</resetMask>
          <fields>
            <field>
              <name>DIRECT_SEL</name>
              <description>Selects a source for HFCLK (when HFCLK_SEL=0) and DSI_IN[0].
Note that not all products support all clock sources.  Selecting a clock source that is not supported will result in undefined behavior.
Note that using DSI_OUT[3:0] as HFCLK source will also result in undefined behavior.  These values are available strictly to provide a clock in DSI_IN[0].</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>IMO - Internal R/C Oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>EXTCLK - External Clock Pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECO</name>
                  <description>ECO - External-Crystal Oscillator (Crystal external, Oscilator internal)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI0</name>
                  <description>DSI_OUT[0]</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI1</name>
                  <description>DSI_OUT[1]</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI2</name>
                  <description>DSI_OUT[2]</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI3</name>
                  <description>DSI_OUT[3]</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBL_SEL</name>
              <description>Selects a source the input of EXCO PLL1, if supported.  
Note that not all products support all clock sources.  Selecting a clock source that is not supported will result in undefined behavior.
Note: this is called DBL_SEL for legacy reasons, and cannot be changed without breaking collateral for multiple existing products.</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>IMO - Internal R/C Oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>EXTCLK - External Clock Pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECO</name>
                  <description>ECO - External-Crystal Oscillator (Crystal external, Oscilator internal)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI0</name>
                  <description>DSI_OUT[0]</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI1</name>
                  <description>DSI_OUT[1]</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI2</name>
                  <description>DSI_OUT[2]</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI3</name>
                  <description>DSI_OUT[3]</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_SEL</name>
              <description>Selects a source the input of EXCO PLL0, if supported.  
Note that not all products support all clock sources.  Selecting a clock source that is not supported will result in undefined behavior.
Note: this is called PLL_SEL for legacy reasons, and cannot be changed without breaking collateral for multiple existing products.</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>IMO - Internal R/C Oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>EXTCLK - External Clock Pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECO</name>
                  <description>ECO - External-Crystal Oscillator (Crystal external, Oscilator internal)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPLL</name>
                  <description>DPLL - DPLL Output</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI0</name>
                  <description>DSI_OUT[0]</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI1</name>
                  <description>DSI_OUT[1]</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI2</name>
                  <description>DSI_OUT[2]</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI3</name>
                  <description>DSI_OUT[3]</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPLLIN_SEL</name>
              <description>Selects a source for the input of DPLL.
Note that not all products support all clock sources.  Selecting a clock source that is not supported will result in undefined behavior.</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>IMO - Internal R/C Oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>EXTCLK - External Clock Pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECO</name>
                  <description>ECO - External-Crystal Oscillator (Crystal external, Oscilator internal)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI0</name>
                  <description>DSI_OUT[0]</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI1</name>
                  <description>DSI_OUT[1]</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI2</name>
                  <description>DSI_OUT[2]</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI3</name>
                  <description>DSI_OUT[3]</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPLLREF_SEL</name>
              <description>Selects a source for the reference (tracking) input of DPLL:
0: DSI_OUT[0]
1: DSI_OUT[1]
2: DSI_OUT[2]
3: DSI_OUT[3]</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSI0</name>
                  <description>DSI_OUT[0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI1</name>
                  <description>DSI_OUT[1]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI2</name>
                  <description>DSI_OUT[2]</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI3</name>
                  <description>DSI_OUT[3]</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT_LOCK</name>
              <description>Prohibits writing to WDT_* registers and CLK_ILO register when not equal 0.  Requires at least two different writes to unlock.
Note that this field is 2 bits to force multiple writes only.  It represents only a single write protect signal protecting all WATCHDOG registers at the same time.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CHG</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR0</name>
                  <description>Clears bit 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR1</name>
                  <description>Clears bit 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET01</name>
                  <description>Sets both bits 0 and 1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFCLK_SEL</name>
              <description>Selects the source for HFCLK.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT_SEL</name>
                  <description>Source selected by DIRECT_SEL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBL</name>
                  <description>Output of DBL (Doubler) - Selects output of EXCO PLL1 if supported.  
Note that not all products support all clock sources.  Selecting a clock source that is not supported will result in undefined behavior.
Note: this is called DBL for legacy reasons, and cannot be changed without breaking collateral for multiple existing products.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>Output of PLL -  Selects output of EXCO PLL0 if supported.  
Note that not all products support all clock sources.  Selecting a clock source that is not supported will result in undefined behavior.
Note: this is called PLL for legacy reasons, and cannot be changed without breaking collateral for multiple existing products.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALF_EN</name>
              <description>This bit impact products using CPUSSv1 only.  It has no effect on products using CPUSSv2.
FLASH Wait-state selection.  This must be set to 1 when clk_sys is set to a frequency greater than 24MHz.
0: Access FLASH using 0 wait-states.  Only use this setting when HFCLK is &lt;=24MHz.
1: Access FLASH using 1 wait-state.  Safe to use this setting for any clock frequency.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCLK_DIV</name>
              <description>SYSCLK Pre-Scaler Value.</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIV</name>
                  <description>SYSCLK= HFCLK/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>SYSCLK= HFCLK/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>SYSCLK= HFCLK/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>SYSCLK= HFCLK/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_16</name>
                  <description>SYSCLK= HFCLK/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_32</name>
                  <description>SYSCLK= HFCLK/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_64</name>
                  <description>SYSCLK= HFCLK/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_128</name>
                  <description>SYSCLK= HFCLK/128</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_ILO_CONFIG</name>
          <description>ILO Configuration</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6</resetValue>
          <resetMask>0x80000007</resetMask>
          <fields>
            <field>
              <name>PD_MODE</name>
              <description>Power down mode.  Note: this bit must always be set to 0 and never changed.  Behavior is undefined when set to 1.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Sleep (faster startup - enables pulsegen block)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMA</name>
                  <description>Coma (slower startup)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TURBO</name>
              <description>Turbo mode for faster startup from coma power down.  Leave this bit at the default setting for normal operation.  Engineering only.
0: turbo disabled
1: turbo enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SATBIAS</name>
              <description>PFET bias.  Leave this bit at the default setting for normal operation.  Engineering only.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SATURATED</name>
                  <description>Enable saturated PFET bias</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUBTHRESHOLD</name>
                  <description>Enable subthreshold PFET bias</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Master enable for ILO oscillator</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_IMO_CONFIG</name>
          <description>IMO Configuration</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80800000</resetValue>
          <resetMask>0xFFC00000</resetMask>
          <fields>
            <field>
              <name>FLASHPUMP_SEL</name>
              <description>Selects operating source for SPCIF Timer/Flash Pump clock.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>No clock, connect to gnd</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK36</name>
                  <description>Use 36MHz oscillator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_FASTBIAS</name>
              <description>Forces the FIMO's fast bias circuits to remain powered (engineering only).  This bit must be cleared by BootROM after FIMO is no longer required.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_FASTBIAS</name>
              <description>Forces the IMO into FIMO mode (engineering only).  Only works when EN_FASTBIAS=1.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_SEL</name>
              <description>N/A</description>
              <bitRange>[27:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>No clock, connect to gnd</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>Use main IMO output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBL</name>
                  <description>Use doubler output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK36</name>
                  <description>Use 36MHz oscillator.  Note: always set EN_CLK36 when selecting this value for PUMP_SEL.  Flash program/erase operations will set EN_CLK36=0 when PUMP_SEL!=CLK36. This selection is ONLY valid for PSoC4A-BLE.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FF1</name>
                  <description>Use divided clock FF1</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST_USB_MODE</name>
              <description>Forces IMO into locking mode.  Engineering only.
1: Software can write FSOFFSET, OFFSET, and GAIN settings for characterization.  Hardware updates to these registers are not blocked, so disable peripheral updates if they are not desired.
0: Normal operation.  IMO operates in either normal or locking mode, depending on settings for the selected external locking peripheral.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK36</name>
              <description>Enables 36MHz secondary oscillator that can be used for Pump or Flash Pump.  Note:  Since there are two consumers of the 36MHz clock, care should be taken when clearing this bit. The correct procedure for clearing this bit is:
1. Disable interrupts
2. Check if both FLASHPUMP_SEL&lt;&gt;1 and PUMP_SEL&lt;&gt;3
3. If so, set EN_CLK36=0
4. Enable interrupts</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK2X</name>
              <description>Enables main oscillator doubler circuit that can be used for TSS Charge Pumps.  This circuit is not available to generate any digital clocks.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Master enable for IMO oscillator.  Clearing this bit will disable the IMO but not disconnect it from the power rail.  This bit can also be used during IDDQ testing.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
