cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
        <register>
          <name>WDT_CONTROL</name>
          <description>Watchdog Counters Control</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0F0F</resetMask>
          <fields>
            <field>
              <name>WDT_ENABLE0</name>
              <description>Enable Counter 0
0: Counter is disabled (not clocked)
1: Counter is enabled (counting up)
Note: This field takes considerable time (up to 3 LFCLK cycles) to take effect.  It must not be changed more than once in that period.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_ENABLED0</name>
              <description>Indicates actual state of counter.  May lag WDT_ENABLE0 by up to 3 LFCLK cycles.  After changing WDT_ENABLE0, do not enter DEEPSLEEP mode until this field acknowledges the change.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT0</name>
              <description>WDT Interrupt Request.  This bit is set by hardware as configured by this registers.  This bit must be cleared by firmware.  Clearing this bit also prevents Reset from happening when WDT_MODEx=3.  After W1C, WDT_CONTROL must be read for the hardware to internally remove the clear flag.  Failure to do this may result in missing the next interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_RESET0</name>
              <description>Resets counter 0 back to 0000.  Hardware will reset this bit after counter was reset.  This will take several LFCLK cycles to take effect.  Wait until the reset completes before enabling the WDT.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_ENABLE1</name>
              <description>Enable Counter 1
0: Counter is disabled (not clocked)
1: Counter is enabled (counting up)
Note: This field takes considerable time (up to 3 LFCLK cycles) to take effect.  It must not be changed more than once in that period.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_ENABLED1</name>
              <description>Indicates actual state of counter.  May lag WDT_ENABLE1 by up to 3 LFCLK cycles.  After changing WDT_ENABLE1, do not enter DEEPSLEEP mode until this field acknowledges the change.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT1</name>
              <description>WDT Interrupt Request.  This bit is set by hardware as configured by this registers.  This bit must be cleared by firmware.  Clearing this bit also prevents Reset from happening when WDT_MODEx=3.  After W1C, WDT_CONTROL must be read for the hardware to internally remove the clear flag.  Failure to do this may result in missing the next interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_RESET1</name>
              <description>Resets counter 1 back to 0000.  Hardware will reset this bit after counter was reset.  This will take several LFCLK cycles to take effect.  Wait until the reset completes before enabling the WDT.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_ENABLE2</name>
              <description>Enable Counter 2
0: Counter is disabled (not clocked)
1: Counter is enabled (counting up)
Note: This field takes considerable time (up to 3 LFCLK cycles) to take effect.  It must not be changed more than once in that period.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_ENABLED2</name>
              <description>Indicates actual state of counter.  May lag WDT_ENABLE2 by up to 3 LFCLK cycles.  After changing WDT_ENABLE2, do not enter DEEPSLEEP mode until this field acknowledges the change.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT2</name>
              <description>WDT Interrupt Request.  This bit is set by hardware as configured by this registers.  This bit must be cleared by firmware.  Clearing this bit also prevents Reset from happening when WDT_MODEx=3.  After W1C, WDT_CONTROL must be read for the hardware to internally remove the clear flag.  Failure to do this may result in missing the next interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_RESET2</name>
              <description>Resets counter 2 back to 0000_0000.  Hardware will reset this bit after counter was reset.  This will take several LFCLK cycles to take effect.  Wait until the reset completes before enabling the WDT.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RES_CAUSE</name>
          <description>Reset Cause Observation Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RESET_WDT</name>
              <description>A WatchDog Timer reset has occurred since last power cycle.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_DSBOD</name>
              <description>This field is deprecated and will always read 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_LOCKUP</name>
              <description>This field is deprecated and will always read 0.  Cortex-M0 LOCKUP is no longer a reset source.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_PROT_FAULT</name>
              <description>A protection violation occurred that requires a RESET.  This includes, but is not limited to, hitting a debug breakpoint while in Privileged Mode.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_SOFT</name>
              <description>Cortex-M0 requested a system reset through it's SYSRESETREQ.  This can be done via a debugger probe or in firmware.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_HVBOD</name>
              <description>This field is deprecated and will always read 0.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_PBOD</name>
              <description>This field is deprecated and will always read 0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_XRES</name>
              <description>This field is deprecated and will always read 0.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_TRIM1</name>
          <description>Power System Trim Register</description>
          <addressOffset>0xFF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>HIB_BIAS_TRIM</name>
              <description>Current reference trim.  This is internally overridden to 3'b010 for startup during POR and STOP wakeup.  Afterward, it uses this setting for hibernate and sleep.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_TURBO_THRESH</name>
              <description>BOD Turbo Threshold Control
0 Turbo Threshold is set to 100mV above BOD trip point
1 Turbo Threshold is set to 50mV above BOD trip point</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_TRIM_TRIP</name>
              <description>BOD trip point trim.  BOD_TRIM_TRIP[2] is ignored and controlled by hardware directly.
0X00: Default trim setting
0X01: Default trim setting - 30mV
0X10: Default trim setting + 30mV
0X11: Invalid Setting (Do Not Use)
1X00: Default trim setting + 90mV
1X01: Default trim setting + 60mV
1X10: Default trim setting + 120mV
1X11: Invalid Setting (Do Not Use)</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_TRIM2</name>
          <description>Power System Trim Register</description>
          <addressOffset>0xFF04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>LFCLK_TRIM_LOAD</name>
              <description>Current load trim capability
00= Min current load capability
11= Max current load capability</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFCLK_TRIM_VOLTAGE</name>
              <description>Output voltage trim
00= default 
01= Trim lfclk by -50mV
10= Trim lfclk by +50mV
11= illegal</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPSLP_TRIM_LOAD</name>
              <description>Current load trim capability
00= Min current load capability
11= Max current load capability</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPSLP_TRIM_LEAKAGE</name>
              <description>Enable Vcchib pass gate leakage control</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPSLP_TRIM_VOLTAGE</name>
              <description>Raise output voltage
1= regulator hibernate 200mV higher
0= nominal 1.4-1.6V range</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_TRIM3</name>
          <description>Power System Trim Register</description>
          <addressOffset>0xFF08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF9</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NWELL_TRIM</name>
              <description>Vnwell (nwell regulator) trim
[0]: Vcchib + nhv(0.6V -1V)
[1]: Vcchib + nlowvt(0.4 -0.8V)
[2]: Vcchib + nhvnat(0.1-0.3)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QUIET_TRIM</name>
              <description>Vccq (quiet regulator) trim</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_TRIM4</name>
          <description>Power System Trim Register</description>
          <addressOffset>0xFF0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>HIB_TRIM_NWELL</name>
              <description>Vnwell Leakage control
00= smart nwell regulation
01= regulate nwell to constant voltage. 
10= regulate nwell to vcchib + nfet diode
11= regulate nwell to vcchib + nfet diode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TRIM_LEAKAGE</name>
              <description>Enable Vcchib pass gate leakage control</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TRIM_VOLTAGE</name>
              <description>Elevate output voltage
1= regulator hibernate 200mV higher 
0= nominal 1.4-1.6V range</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TRIM_REFERENCE</name>
              <description>Hibernate Reference trim
10=Trim reference by -27mV
01=Trim reference by +27mV
00= no trim</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM1</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x43</resetValue>
          <resetMask>0x7F</resetMask>
          <fields>
            <field>
              <name>INL_TRIM_MAIN</name>
              <description>Bandgap nonlinear current trim for curvature correction (main current reference).</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INL_CROSS_MAIN</name>
              <description>Bandgap INL cross-over point control for centering curve at 30C (main current reference).</description>
              <bitRange>[6:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM2</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VCTAT_SLOPE</name>
              <description>Output slope setting controls. The slope of the voltage with temperature varies from ~0 percent to ~15 percent from the value at 55C over the temperature range -40C to 150C based on control signal settings 0 to 15</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_VOLTAGE</name>
              <description>Output voltage absolute trim (LSBs).  MSB is in VCTAT_VOLTAGE_MSB field.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_ENABLE</name>
              <description>Enable VCTAT block</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_VOLTAGE_MSB</name>
              <description>Output voltage absolute trim (MSB)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM3</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5F</resetValue>
          <resetMask>0x7F</resetMask>
          <fields>
            <field>
              <name>INL_TRIM_IMO</name>
              <description>IMO Irefgen nonlinear current trim for curvature correction.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INL_CROSS_IMO</name>
              <description>IMO Irefgen INL cross-over point control for centering curve at 30C.</description>
              <bitRange>[6:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM4</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>ABS_TRIM_IMO</name>
              <description>IMO-irefgen output current magnitude trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM5</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>TMPCO_TRIM_IMO</name>
              <description>IMO-irefgen output current temperature co-efficient trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_ILO_TRIM</name>
          <description>ILO Trim Register</description>
          <addressOffset>0xFF24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x38</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Trim bits to control frequency
0: Minimum frequency
15: Maximum frequency</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COARSE_TRIM</name>
              <description>Adjusts the bias in the event of high current after fab.  Leave these bits at the default setting for normal operation.:
Bias trim:
bit3=0: Normal Mode
bit3=1:Low Current Mode

Resistor Trim (Short R to gnd):
bit2=0: Normal Mode
bit2=1: Short R/4
bit1=0: Unshort R/2
bit1=1: Normal Mode (Short R/2)
bit0=0: Unshort R/4
bit0=1: Normal Mode (Short 3R/4)</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_IMO_TRIM1</name>
          <description>IMO Trim Register</description>
          <addressOffset>0xFF28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.  

