cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE</name>
      <description>Bluetooth Low Energy Subsystem</description>
      <baseAddress>0x402E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <name>BLERD</name>
          <description>#REF!</description>
          <addressOffset>0x00000000</addressOffset>
          <register>
            <name>CFG1</name>
            <description>Generic configure register.</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xBA40</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RX_DATA_INVERSE</name>
                <description>Invert demodulation receiving data,high active</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_DATA_INVERSE</name>
                <description>invert modulation transmit data, high active</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGC_DISABLE</name>
                <description>1: disabel the AGC, the LNA+TIA and CBPF gain are given based on bits [15:11] of reg0.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RF_PLL_DIRECT</name>
                <description>program channel freqency as direct frequency mode. high active.
When RF_PLL_DIRECT = 1, RF = reg0x10[11:0] Mhz.
When RF_PLL_DIRECT = 0, RF = 2402 + 2*reg7[5:0] Mhz.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLKGATING_DISABLE</name>
                <description>1. disable the clock gating logic golbally. Indepenedent of any other cnditions. None of the clocks can be gated when this bit is set.
0: clock gating logic is enabled, the logic in clk_gen will determine which clocks are to be gated.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_BR_CLK</name>
                <description>1: enable brclk output</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADC_IQ_INVERSE</name>
                <description>1: swap ADC I, Q path</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_PA_RAMP_MODE</name>
                <description>1:ramp to PA gain which given txpa_gain in 2dB steps, starting from min gain.
0: ramp to PA gin which given in txpa_gain in one short from min gain</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RADIO_STANDALONE</name>
                <description>1: radio standalone without link layer controller in SoC, Tx command from reg0x10[13] and RX command from reg0x10[12]</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADC_DC_CAPTURE_EN</name>
                <description>1: ADC DC capture enable</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BURNIN_CLK_EN</name>
                <description>burn in function mode 
1: digital main clock from clk_core. 
0: digital main clock from HardIP</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CBPF_GAIN</name>
                <description>CBPF manually gain setting when AGC is disabled by asserting bit[2]. This gain is truly reflective of the voltage gain across the CBPF and is determined by the ratio of resisters
11: 15dB, 10: 12dB, 01: 3dB, 00: 0dB</description>
                <bitRange>[12:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LNA_GAIN</name>
                <description>LNA+TIA manual gain setting when AGC is disabled by asserting bit[2]. The gain obtained is a function of the LNA gm as well as the TIA feedback resister.
000: VLG
001: LG
010: MH 
011: IHG
100: HG
101: VHG
110, 111: Illegal Value</description>
                <bitRange>[15:13]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG2</name>
            <description>Generic configure register.</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x200</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DAC_REG_DATA</name>
                <description>DAC input from this register when CFG2_DAC_DFT_EN =1 and dft_mode = 2'b00</description>
                <bitRange>[9:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DAC_DFT_MODE</name>
                <description>DAC DFT mode definition
00: DAC input from dac_reg_data[9:0]
01: DAC input as 12Mhz increased value
10: DAC input as 1MHz Sine Wave
11: DAC input as 4MHz SIN wave</description>
                <bitRange>[11:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DAC_DFT_EN</name>
                <description>1: DAC DFT mode enable</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADC_DFT_MODE</name>
                <description>ADC DFT mode selection (Available on Atlantis TC only)
00: 3 sample I path data to read_i_adc_1. 3 sample Q path data to read_q_adc_2.
10: discard LSB both I and Q path data. 2 bytes I and Q path data to read_iq_adc with 6MHz updat
11: discard LSB both I and Q path data. 2 bytes I and Q path data to read_iq_adc with 3MHz updat</description>
                <bitRange>[14:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADC_DFT_EN</name>
                <description>1: ADC DFT enable</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MODEM</name>
            <description>modem configuration</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x1068</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>NARROW_SPD</name>
                <description>set alpha value for dC offset tracking speed in narrow mode
00: dc value times 1
01: dc value times 2
10: dc value times 3
11: dc value times 4</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WIDE_SPD</name>
                <description>demodulation alpha value for DC offset tracking in wide speed
00: dc value times 8
01: dc value times 10
10: dc value times 12
11: dc value times 14</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RST_CNT2_SEL</name>
                <description>soft reset condition selection, 0: 32bits all ''0'/'1', 1: 16bits all '0'/'1'</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESET2_EN</name>
                <description>demodulation soft reset enable, 0: diable, 1: enable soft reset</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DC_PARAM</name>
                <description>demodulation frequency deviation selection
00: 320K, 01: 350K, 10: 400K, 11:430K</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IMREJ_BYPASS</name>
                <description>bypass image filter in demoulation</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADC_FULL_SWING_DETECT_EN</name>
                <description>1: select new AGC methodology with ADC full swing detection</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DC_SCALING_EN</name>
                <description>1: DC scaling is enabled in the Demodulator. The Scaling happens when CBPF gain changes.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADC_PWR_EST_EN</name>
                <description>1: power estimation for ADC output is enabled.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOAD_PREV_GAIN_EN</name>
                <description>1: load previous RX packet gain setting at first gain change step
0: not load previous RX packet gain.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>READ_DC_OFFSET_SEL</name>
                <description>1: read back of analog DC CAL result.
0: read back of DC capture in digital</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADCDFT_SEL</name>
                <description>1: ADC DFT capture data after image filter
0: ADC DFT capture data before image filter</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CW_MODE</name>
                <description>1: modulation continue wave output</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FSM</name>
            <description>RFCTRL state information</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0xC010</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>XO_AMP_DETECT</name>
                <description>1: XO is oscillating reached 60 percent ampitude. 
0: XO is no oscillating or not reached 60 percent ampitude. BLERD_BB_XO[1] determines fast or normal charge. From MXIE(BLERF designer) confimation, XO within 50ppm needs 2 times of XO detection
BLERD_BB_XO[1]     XO_amp_detect      XO stable
           1                         320us                  640us
           0                        1120us                 2.24ms</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>LSLDO_OK</name>
                <description>1: LS LDO powered up</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>LFLDO_OK</name>
                <description>1: LF LDO powered up</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>FCAL_PASS_DETECT</name>
                <description>TX balun power detector, 
1: Frequency calibration has passed.
0: Frequency calibration has failed</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ISO_ENABLE</name>
                <description>monitor isolation cell enable signal
1: isolation cell enabled.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_STATE</name>
                <description>RFCTRL RX state
000: RX Off
001: RX Regulator Powerup
010: RX Baseband and IF Powerup
011: DC Calibration
100: RX Wait for PLL settling
101: RX ADC DC value capture
110: RX Receive ON
111: non existing RX FSM</description>
                <bitRange>[7:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_STATE</name>
                <description>RFCTRL TX state
000: TX Off
001: TX Regulator Powerup
010: TX Baseband Powerup
011: KV Calibration
100: TX PLL Settling
101: TX Ready
110, 111: non existing TX FSM</description>
                <bitRange>[10:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SY_STATE</name>
                <description>RFCTRL SYNTH state
000: SY off,    
001: SY Regulator power up, 
010: SY VCO pup up
011: SY LO path power up, 
100: Frequency calibration, 
101: PLL setting. 
110: PLL locked
111: non existing SY FSM</description>
                <bitRange>[13:11]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>STATE</name>
                <description>RFCTRL major state, 
00: sleep mode, 
11: idle mode, 
10: TX mode, 
01: RX mode</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBUS</name>
            <description>RFCTRL mode transition control</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x4992</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RF_FREQ</name>
                <description>When CFG1_RF_PLL_DIRECT=1, RF frequency is direct program from DBUS register [11:0]</description>
                <bitRange>[11:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIRECT_RXEN</name>
                <description>When cfg1_radio_standalone =1, debus_direct_rxen replace dbus_rx_en</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIRECT_TXEN</name>
                <description>When cfg1_radio_standalone =1, debus_direct_rxen replace dbus_rx_en</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ISOLATE_N</name>
                <description>force isolation cell enable of analog / digital boundary. low active</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XTAL_ENABLE</name>
                <description>crystal enable. High active</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGCTRL</name>
            <description>RFCTRL running configuration</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x18</resetValue>
            <resetMask>0x8FFF</resetMask>
            <fields>
              <field>
                <name>DSM_MODE</name>
                <description>Cfgctrl_dsm_mode[4]: 
1'b0: Third order PLL is used in TX mode, this is not effective in RX mode
1'b1: First order PLL is used in TX mode, this is not effective in RX mode

