cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
Cfgctrl_dsm_mode[3:2]
The following bits determine the DSM mode in TX
00: Input dither but no initial condition for DSM
01: Input dither and initial condition to DSM.
10: No input dither and initial condition
11: No input dither but initial condition is given

Cfgctrl_dsm_mode[1:0]
The following bits determine the DSM mode in RX
00: Input dither but no initial condition for DSM
01: Input dither and initial condition to DSM.
10: No input dither and initial condition
11: No input dither but initial condition is given</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IGNORE_FRAC</name>
                <description>0: Do not ignore fractional part in DSM (Frac-N PLL).
1: Ignore the fractional part in DSM (Int-N PLL).</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DCCAL_RERUN</name>
                <description>1: DC CAL is forced to run  when cfgctrl_testmode_en = 1</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DCCAL_MODE</name>
                <description>0: RX DC offset calibration in run normal mode
1: RX DC offset calibration is run in slow mode. Here each step in calibration is given double time compared to the normal mode</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RCCAL_RERUN</name>
                <description>1: RC-cal force to rerun when cfgctrl_testmode_en = 1</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RCCAL_MODE</name>
                <description>0: normal mode
1: slow mode, The timer for each setp in calibration is doubled with normal mode</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>KVCAL_RERUN</name>
                <description>1: FCAL will be force rerun when cfgctrl_testmode_en = 1</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FCAL_RERUN</name>
                <description>1: KVCAL will be force rerun when cfgctrl_testmode_en = 1</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TESTMODE_EN</name>
                <description>1: enables the test mode feature of RFCTRL</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RSSI</name>
            <description>RX envelpe detector and RSSI value</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7F7F</resetMask>
            <fields>
              <field>
                <name>PREFILT</name>
                <description>RSSI value before the filter in thd digital, 0 represents -85dBm</description>
                <bitRange>[6:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>POSTFILT</name>
                <description>RSSI value after the filter in digital, 0 represents -85dBm</description>
                <bitRange>[14:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RMAP</name>
            <description>BG LDO bypass mode</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>BB_BYPASS</name>
                <description>N/A</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>KVCAL</name>
            <description>KVCAL running configuration</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x640</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>DAC_STEP</name>
                <description>This values tells by what value should the DAC be offset from the mid-code, when the KVCAL is running.
00 : 512 (1MHz deviation).
01: 376  (0.75 Mhz deviation).
10: 256 (0.5 Mhz deviation)
11 : 128 (0.25 Mhz deviation</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RUN_DURATION</name>
                <description>This values tells by what value duration when FCAL is running.
00 : 25us.
01: 33.375us
10: 50us
11 : 100us</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EXP_FREQ_DIFF</name>
                <description>This expected difference in KVCAL configuration counts(100 counts for an ideal modulalation path gain)</description>
                <bitRange>[11:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG_1_FCAL</name>
            <description>FCAL running configure 5_6</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x387</resetValue>
            <resetMask>0x3FFF</resetMask>
            <fields>
              <field>
                <name>COARSE_FRAMES_6</name>
                <description>numbere of frames to run for the calibration 6th coarse bit</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COARSE_FRAMES_7</name>
                <description>numbere of frames to run for the calibration 7th coarse bit</description>
                <bitRange>[13:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG_2_FCAL</name>
            <description>FCAL running configure 7_2</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x387</resetValue>
            <resetMask>0x3FFF</resetMask>
            <fields>
              <field>
                <name>COARSE_FRAMES_4</name>
                <description>numbere of frames to run for the calibration 4th coarse bit</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COARSE_FRAMES_5</name>
                <description>numbere of frames to run for the calibration 5th coarse bit</description>
                <bitRange>[13:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG_3_FCAL</name>
            <description>FCAL running configure 3_4</description>
            <addressOffset>0x34</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x387</resetValue>
            <resetMask>0x3FFF</resetMask>
            <fields>
              <field>
                <name>COARSE_FRAMES_2</name>
                <description>numbere of frames to run for the calibration 2nd coarse bit</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COARSE_FRAMES_3</name>
                <description>numbere of frames to run for the calibration 3rd coarse bit</description>
                <bitRange>[13:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG_4_FCAL</name>
            <description>FCAL running configure 0_1</description>
            <addressOffset>0x38</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x387</resetValue>
            <resetMask>0x3FFF</resetMask>
            <fields>
              <field>
                <name>COARSE_FRAMES_0</name>
                <description>numbere of frames to run for the calibration 0th coarse bit</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COARSE_FRAMES_1</name>
                <description>numbere of frames to run for the calibration 1st coarse bit</description>
                <bitRange>[13:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG_5_FCAL</name>
            <description>FCAL running framer fine</description>
            <addressOffset>0x3C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x78E</resetValue>
            <resetMask>0x7FF</resetMask>
            <fields>
              <field>
                <name>FINE_FRAMES</name>
                <description>numbere of frames to run for all the calibration of all the Fine bits</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_SEL</name>
                <description>select which count should be reflected in the FCAL_DBG_2 and FCAL_DBG_3 registers
4'd1: FCAL 7th Coarse bit calibration
4'd2: FCAL 6th Coarse bit calibration
4'd3: FCAL 5th Coarse bit calibration
4'd4: FCAL 4th Coarse bit calibration
4'd5: FCAL 3rd Coarse bit calibration
4'd6: FCAL 2nd Coarse bit calibration
4'd7: FCAL 1st Coarse bit calibration
4'd8: FCAL 0th Coarse bit calibration
4'd9: FCAL 3rd Fine bit calibration
4'd10: FCAL 2nd Fine bit calibration
4'd11: FCAL 1st Fine bit calibration
4'd12: FCAL 0th Fine bit calibration
4'd13: VCO Open loop count
4'd14: KVCAL Observed Count
4'd15: KVCAL Gain
Default: Gives zero output</description>
                <bitRange>[10:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CFG_6_FCAL</name>
            <description>FCAL running VCO OL</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x200</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>FRAMES_VCO_OL</name>
                <description>Number of frames to run  in VCO openloop Characterization .
If bit[12] 'fcal_drift_check_en' is asserted, then this field indicates for how many frames the FCAL drift has to be measured</description>
                <bitRange>[10:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VCO_OL_ENBL</name>
                <description>1:enable vco openloop characterization</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DRIFT_CHECK_EN</name>
                <description>enables the FCAL drift check, This needs to be set prior to the TX burst being programmed as it affects the timing sequence.
Ensure that FB buffer has not been powered down such that the FCAL counter is left alive. This requires a cahgne to reg0xcc[5] to be set to 0 (disable FB buffer power save). This needs to be set piror to placing the part in TX mode</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DRIFT_CHECK</name>
                <description>00: start drift check when the TX driver is powered up
01: start drift check measurement 100us after TX driver is power ed up
10: start drift check measurement 200us after the TX driver is powered up
11: start drift check measurement 300us after the TX drive is powered up</description>
                <bitRange>[14:13]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FCAL_TEST</name>
            <description>FCAL test mode configuration</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>FINE</name>
                <description>force fine bits output of the FCAL engine when test_mode is set</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COARSE</name>
                <description>force coarse bits output of the FCAL engine when test_mode is set</description>
                <bitRange>[11:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MODE</name>
                <description>force the coarse and fine bits of FCAL output enable, high active</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CNT_POLARITY</name>
                <description>1: Inverts the polarity of the FCAL counter output coming in to the RFCTRL</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOOP_POLARITY</name>
                <description>1: Inverts the polarity of the FCAL loop. In this mode the DCAP code is decreased if observed count is greater than target count.
0: This is normal FCAL loop, where DCAP code is increased if the observed count is greater than target_count</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TEST</name>
            <description>RCCAL and procmon test configuration</description>
            <addressOffset>0x48</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>KVCAL_GAIN</name>
                <description>this code is forced as the KV_CAL code when  when test_kvcal_mode = 1</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>KVCAL_MODE</name>
                <description>1: KV-CAL code is forced to the given code</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FRCCAL_CODE</name>
                <description>this code is forced as the RC_CAL code when test_frccal_mode = 1</description>
                <bitRange>[12:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FRCCAL_MODE</name>
                <description>1: RC-CAL code is forced to the given code</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FRCCAL_POLARITY</name>
                <description>1: invert RC CAL polarity.</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FPD_TEST</name>
            <description>LDOs test</description>
            <addressOffset>0x4C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F9D</resetMask>
            <fields>
              <field>
                <name>BB_FPUP_XO_BUF_ALL</name>
                <description>1: forcefully powers down all the buffers in XO if cfgctrl_testmode_en = 1</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BB_XO_BUF_ADC</name>
                <description>1: forcefully powers down xo buffer to ADC if cfgctrl_testmode_en = 1</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BB_XO_BUF_SY</name>
                <description>1: forcefully powers down xo buffer to synth if cfgctrl_testmode_en = 1</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BB_RCCAL_BLOCK</name>
                <description>1: forcefully powers down the RC CAL block if cfgctrl_testmode_en = 1</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FAST_CHARGE</name>
                <description>1: force power the fast charge bit for LDO Lopath if cfgctrl_testmode_en = 1</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_LDOVCO</name>
                <description>1: force power down SY LDOVCO if cfgctrl_testmode_en = 1</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_LDOLOPATH</name>
                <description>1: force power down SY LDO LOPATH  if cfgctrl_testmode_en = 1</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_LDOFFFB</name>
                <description>1: force power down SY LDO LOFFFB if cfgctrl_testmode_en = 1</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BALUN_HFLDO</name>
                <description>1: Balun HF LDO is forced power down if cfgctrl_testmode_en = 1</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BALUN_CTUNE</name>
                <description>1: force powerdown Balun Ctune block if cfgctrl_testmode_en = 1</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FPUP_ALL</name>
                <description>1: This is used to force powerup the blocks controlled by this register. Fpd has higher precedence over force_powerup if cfgctrl_testmode_en = 1</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
