cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
          <register>
            <name>SY</name>
            <description>SY test configuration 1</description>
            <addressOffset>0x50</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFF7</resetMask>
            <fields>
              <field>
                <name>TEST_FPD_IBIAS</name>
                <description>SY IBIAS block is forced powered down, if this bit is set and cfgctrl_testmode_en = 1</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_VCO</name>
                <description>SY VCO block is forced powered down, if this bit is set and RF_TST_EN = 1</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_DIV2</name>
                <description>SY high speed divider block is forced powered down, if this bit is set and cfgctrl_testmode_en = 1</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_LOPATHDIVN</name>
                <description>SY LOpath DIVN buffer is forced powered down, if this bit is set and cfgctrl_testmode_en = 1</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_DIV2_BUF</name>
                <description>SY LOpath FCAL buffer is forced powered down, if this bit is set and cfgctrl_testmode_en = 1</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_DIVN</name>
                <description>SY DIVN block is forced powered down, if this bit is set and cfgctrl_testmode_en = 1</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_FCAL</name>
                <description>SY FCAL counter is forced powered down, if this bit is set and cfgctrl_testmode_en = 1</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_CPLPF</name>
                <description>SY CP and LPF are forced powered down, if this bit is set and cfgctrl_testmode_en = 1</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_LOPATHTX</name>
                <description>SY LOpath TX buffer is forced powered down, if this bit is set and cfgctrl_testmode_en = 1</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_DIV2_DRV</name>
                <description>the TX powersave bit si force to zero if this bit is asserted and and cfgctrl_testmode_en = 1</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_TX_POWERSAVE</name>
                <description>The fcal amp is forced powered down, if this bit is asserted and cfgctrl_testmode_en = 1</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_FCAL_AMP</name>
                <description>The fcal amp is forced powered down, if this bit is asserted and cfgctrl_testmode_en = 1</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_OPENLOOP</name>
                <description>The loop_freeze is forced low if this bit is asserted and cfgctrl_testmode_en = 1</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_LOOP_FREEZE</name>
                <description>1: loop freeze is forced low if cfgctrl_testmode_en = 1</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPUP_ALL</name>
                <description>1: all the blocks in SY are forced power up if cfgctrl_testmode_en = 1</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TEST2_SY</name>
            <description>SY test configuration 2</description>
            <addressOffset>0x54</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFEF</resetMask>
            <fields>
              <field>
                <name>ICP_CODE</name>
                <description>ICP code will be programmed with these bits.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FPD_DSM_RUN</name>
                <description>DSM run signal is de-asserted if this bit si set and rfctrl_testmode_en = 1</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_DSM_RUN</name>
                <description>DSM_run signal is asserted if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_DSM_FRAC</name>
                <description>1: Force the MSB 8bit of the DSM fractional part with Reg[15-8]. The LSB bits should be 0.
0: DSM fractional bits will be driven by Timing Engine</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_FRAC</name>
                <description>fore bits for  DSM fractional bits if test2_sy_force_dsm_frac=1</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX</name>
            <description>transmit test configuration</description>
            <addressOffset>0x58</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1FF</resetMask>
            <fields>
              <field>
                <name>TEST_FPD_IBIAS</name>
                <description>1: forced power down TX ibias if rfctrl_testmode_en = 1</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_DAC</name>
                <description>1: forced power down TX DAC if rfctrl_testmode_en = 1</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_LPF</name>
                <description>1: forced power down TX LPF if rfctrl_testmode_en = 1</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_DRIVER</name>
                <description>1: forced power down TX driver if rfctrl_testmode_en = 1</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_PREDRIVER</name>
                <description>1: forced power down TX pre-drive if rfctrl_testmode_en = 1</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_FN_TXEN</name>
                <description>the modulator control signal f_n_txen is deasswerted, if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_KVM_NFDEV</name>
                <description>modulator will not enable negative 1Mhz frequency deviation mode, if this bit is set and rfctrl_testmdoe_en = 1</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_KVM_PFDEV</name>
                <description>modulator will not enable positive 1Mhz frequency deviation mode, if this bit is set and rfctrl_testmdoe_en = 1</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPUP_TX_ALL</name>
                <description>force powerup all the TX blocks if rfctrl_testmode_en = 1</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX</name>
            <description>RX test configuration</description>
            <addressOffset>0x5C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1FFF</resetMask>
            <fields>
              <field>
                <name>TEST_FPD_IBIAS</name>
                <description>1:force power down RX IBIAS block if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_ADC_ICORE</name>
                <description>1:force power down RX ADC I Core block is force powerdown if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_ADC_IREFGEN</name>
                <description>1:force power donw RX ADC IREF generation lock,if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_ADC_QCORE</name>
                <description>1:force power down RX ADC Q Core block is force powerdown if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_ADC_QREFGEN</name>
                <description>1:force power donw RX ADC QREF generation lock,if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_BPF</name>
                <description>1:force power down RX BPF, if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_TIA</name>
                <description>1:force power down RX TIA if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_MIXER_LO</name>
                <description>1:force power down RX MIXER LO block if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_MIXER_RF</name>
                <description>1: force power down RX MIXER RF block if rfctrl_testmode_en = 1.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_LNA</name>
                <description>1: force power down RX LNA if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_LNA_HIZ</name>
                <description>1:LNA HIZ signal is deasserted, if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPD_FN_RXEN</name>
                <description>1:the demodulator control signal f_n_rxen is deasserted if this bit is set and rfctrl_tesmode_en=1</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_FPUP_RX_ALL</name>
                <description>1:force powerup all RX blocks,if this bit is set and rfctrl_testmode_en = 1</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIAG1</name>
            <description>RF diagnostics configuration 1</description>
            <addressOffset>0x60</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x1</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>DISABLE</name>
                <description>1: diagnaositcs for all blocks are disabled
0: diagnostics are enabled at global level. The diagnostics for each block is controlled by a corresponding block level diag_enable signal</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CODE</name>
                <description>global diagnositic code, this is given to all the blocks. The block wihich has the diagnostics enabled will decode this code</description>
                <bitRange>[4:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL</name>
                <description>N/A</description>
                <bitRange>[9:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IM</name>
            <description>inject monitor configuration</description>
            <addressOffset>0x64</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x21</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DIAG_MON_DISABLE</name>
                <description>1:globally disable the monitor</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIAG_MONI_CODE</name>
                <description>monitor code, this determines from lock how the monitor is being driven:
Code     moni_p                    moni_n
4'd 1      dac_outp                  gnd
4'd 2      lpf_out                      gnd
4'd 4      I  TIA out_p                I  TIA out_n
4'd 5     Q TIA out_p               Q TIA out_n
4'd 6      I  CBPF out_p            I  CBPF out_n
4'd 7     Q CBPF out_p           Q CBPF out_n
4'd 8      I  CBPF out_p            Q CBPF out_n
4'd 9     Q CBPF out_p            I  CBPF out_n
4'd0, 4'd3, 4'd10, 4'd11, 4'd12, 4'd13, 4'd14, 4'd15: unused</description>
                <bitRange>[4:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIAG_INJ_DISABLE</name>
                <description>1:globally disable the injection</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIAG_INJ_CODE</name>
                <description>injection code. This determines for which block the injection enabled
Code:       inj_p                    inj_n
4'h1:        vin_lpf                 unused
4'd 4         I TIA in_p            I TIA in_n
4'd 5        Q TIA in_p          Q TIA in_n
4'd 6         I TIA in_p           Q TIA in_n
4'd 7         Q TIA in_p          I TIA in_n
4'd 8         I ADC in_p          I ADC in_n
4'd 9        Q ADC in_p        Q ADC in_n
4'h0, 4'd2, 4'd2, 4'd10, 4'd11, 4'd12, 4'd13, 4'd14, 4'd15 are unused</description>
                <bitRange>[9:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIAG_LOOPBACK</name>
                <description>1: This will be used to monitor various outputs in the chip and inject them to on-chip ADC
0: no monitor to injection loopback</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIAG_BUMP</name>
                <description>diag bump code
im_diag_bump[3:2]
2'b00: Mon OTA ref. voltage is 0.9V
2'b01: Mon OTA ref: vlotage is 1.0V
2'b10: Mon OTA ref: vlotage is 1.1V
2'b11: Mon OTA ref: vlotage is 0.8V
im_diag_bump[1:0]
2'b00: Inj OTA ref. voltage is 0.9V
2'b01: Inj OTA ref: vlotage is 1.0V
2'b10: Inj OTA ref: vlotage is 1.1V
2'b11: Inj OTA ref: vlotage is 0.8V</description>
                <bitRange>[14:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIAG_RESV</name>
                <description>N/A</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LDO_BYPASS</name>
            <description>LDOs bypass configuration</description>
            <addressOffset>0x68</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SYLDOVCO</name>
                <description>1: Synth LDO_VCO is bypassed. It should not be enable if line voltage is more than 2.1V. This bit should not toggle in scan mode</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SYLDOLOPATH</name>
                <description>1: Synth LDO_LOPATH  is bypassed. It should not be enable if line voltage is more than 2.1V. This bit should not toggle in scan mode</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SYLDOFFFB</name>
                <description>1: Synth LDO_FFFB is bypassed. It should not be enable if line voltage is more than 2.1V. This bit should not toggle in scan mode</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HFLDO</name>
                <description>1: BB SY HF LDO is bypassed. It should not be enable if line voltage is more than 2.1V. This bit should not toggle in scan mode</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESV_LDOBP</name>
                <description>N/A</description>
                <bitRange>[15:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
