cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
          <register>
            <name>LDO</name>
            <description>bump bit for LDOs Atlantis</description>
            <addressOffset>0x6C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>BUMP_BALUM_HF</name>
                <description>3'd0: HF LDO output is 1.800V
3'd1: HF LDO output is 1.846V
3'd2: HF LDO output is 1.894V
3'd3: HF LDO output is 1.946V
3'd4: HF LDO output is 2.000V
3'd5: HF LDO output is 1.649V
3'd6: HF LDO output is 1.701V
3'd7: HF LDO output is 1.756V</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUMP_SY_VCO</name>
                <description>2'd0: VCO LDO outputs are 1.413V
2'd1: VCO LDO outputs are 1.494V
2'd2: VCO LDO outputs are 1.329V
2'd3: VCO LDO outputs are 1.371V</description>
                <bitRange>[4:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUMP_SY_LOPATH</name>
                <description>2'd0: LOPATH LDO outputs are 1.762V
2'd1: LOPATH LDO outputs are 1.861V
2'd2: LOPATH LDO outputs are 1.673V
2'd3: LOPATH LDO outputs are 1.716V</description>
                <bitRange>[6:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUMP_SY_LHV</name>
                <description>2'd0: HV LDO outputs are 1.894V
2'd1: HV LDO outputs are 2.000V
2'd2: HV LDO outputs are 1.800V
2'd3: HV LDO outputs are 1.846V</description>
                <bitRange>[8:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUMP_SY_FFFB</name>
                <description>3'd0: FF and FB LDO outputs are 1.800V
3'd1: FF and FB LDO outputs are 1.846V
3'd2: FF and FB LDO outputs are 1.894V
3'd3: FF and FB LDO outputs are 1.946V
3'd4: FF and FB LDO outputs are 2.000V
3'd5: FF and FB LDO outputs are 1.649V
3'd6: FF and FB LDO outputs are 1.701V
3'd7: FF and FB LDO outputs are 1.756V</description>
                <bitRange>[11:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_LDO</name>
                <description>received for feature</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BB_BUMP1</name>
            <description>bump bit for LDOs BB,TXRX</description>
            <addressOffset>0x70</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xDFFF</resetMask>
            <fields>
              <field>
                <name>REFCORE_VDD</name>
                <description>2'd0: Bumps the Ibias current of Refcore to 10u
2'd1: Bumps the Ibias current of Refcore to 9.1u
2'd2: Bumps the Ibias current of Refcore to 11.1u
2'd3: Bumps the Ibias current of Refcore to 12.5u</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>V2I_REG</name>
                <description>Bit[4]
1: Error amp quiescent current is 5u
0: Error amp quiescent current is 10u

Bit[3:2]
2'd0: V2I LDO output is 1.8V
2'd1: V2I LDO output is 1.85V
2'd2: V2I LDO output is 1.9V
2'd3: V2I LDO output is 1.75V</description>
                <bitRange>[4:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LFLDO</name>
                <description>3'd0: XO LDO output is 1.894V; BB LDO output is 1.800V
3'd1: XO LDO output is 1.946V; BB LDO output is 1.846V
3'd2: XO LDO output is 2.000V; BB LDO output is 1.894V
3'd3: XO LDO output is 2.000V; BB LDO output is 1.946V
3'd4: XO LDO output is 1.701V; BB LDO output is 1.649V
3'd5: XO LDO output is 1.756V; BB LDO output is 1.649V 
3'd6: XO LDO output is 1.800V; BB LDO output is 1.701V
3'd7: XO LDO output is 1.846V; BB LDO output is 1.756V</description>
                <bitRange>[7:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LSLDO</name>
                <description>3'd0: LS LDO output is 1.708V
3'd1: LS LDO output is 1.747V
3'd2: LS LDO output is 1.802V
3'd3: LS LDO output is 1.849V
3'd4: LS LDO output is 1.904V
3'd5: LS LDO output is 1.552V
3'd6: LS LDO output is 1.591V
3'd7: LS LDO output is 1.650V</description>
                <bitRange>[10:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_BBBUMP</name>
                <description>N/A</description>
                <bitRange>[12:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_BGSTARTUP</name>
                <description>1: force BG start u\p</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FPD_REFORCE</name>
                <description>1: Force Power down for refcore</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BB_BUMP2</name>
            <description>BB bump configuration</description>
            <addressOffset>0x74</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>V2I_RCAL</name>
                <description>Bit[4]
1: Error amp quiescent current is 5u
0: Error amp quiescent current is 10u

Bit[3:0]
4'd0: Trims the RCAL current by 0 percent
4'd1: Trims the RCAL current by -2.5 percent
4'd2: Trims the RCAL current by -5 percent
4'd3: Trims the RCAL current by -7.5 percent
4'd4: Trims the RCAL current by -10 percent
4'd5: Trims the BGR current by -12.5 percent
4'd6: Trims the BGR current by -15 percent
4'd7: Trims the BGR current by -17.5 percent
4'd8: Trims the BGR current by 20 percent
4'd9: Trims the BGR current by 17.5 percent
4'd10: Trims the BGR current by 15 percent
4'd11: Trims the BGR current by 12.5 percent
4'd12: Trims the BGR current by 10 percent
4'd13: Trims the BGR current by 7.5 percent
4'd14: Trims the BGR current by 5 percent
4'd15: Trims the BGR current by 2.5 percent</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>V2I</name>
                <description>Bit[9]
1: Error amp quiescent current is 5u
0: Error amp quiescent current is 10u

Bit[8:5]
4'd0: Trims the BGR current by 0 percent
4'd1: Trims the BGR current by -2.5 percent
4'd2: Trims the BGR current by -5 percent
4'd3: Trims the BGR current by -7.5 percent
4'd4: Trims the BGR current by -10 percent
4'd5: Trims the BGR current by -12.5 percent
4'd6: Trims the BGR current by -15 percent
4'd7: Trims the BGR current by -17.5 percent
4'd8: Trims the BGR current by 20 percent
4'd9: Trims the BGR current by 17.5 percent
4'd10: Trims the BGR current by 15 percent
4'd11: Trims the BGR current by 12.5 percent
4'd12: Trims the BGR current by 10 percent
4'd13: Trims the BGR current by 7.5 percent
4'd14: Trims the BGR current by 5 percent
4'd15: Trims the BGR current by 2.5 percent</description>
                <bitRange>[9:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VBG_TRIM</name>
                <description>3'd0: Trims the Bandgap voltage by 0 percent
3'd1: Trims the Bandgap voltage by 1.6 percent
3'd2: Trims the Bandgap voltage by 3.2 percent
3'd3: Trims the Bandgap voltage by 4.8 percent
3'd4: Trims the Bandgap voltage by 6.4 percent
3'd5: Trims the Bandgap voltage by -4.8 percent
3'd6: Trims the Bandgap voltage by -3.2 percent
3'd7: Trims the Bandgap voltage by -1.6 percent</description>
                <bitRange>[12:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_IBIAS</name>
                <description>3'b1xx: RCAL current bumped
3'b0xx: BG current bumped.
2'bxx: reperesent current bump
    01: +12.5 percent, 00: 0 percent, 11: -12.5 percent, 10:-25 percent</description>
                <bitRange>[15:13]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BB_XO</name>
            <description>BB bump configuration 1</description>
            <addressOffset>0x78</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DIS_XOCORE_SUPFILT</name>
                <description>Enables/Disables the supply filter of the XO core.
1: Disabled
0: Enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_RE_FASTSTART</name>
                <description>Enables/Disables the RC faststart block in the XO. When enabled, this block provides a surge current at xo startup to reduce the settling time of the XO.
1: RC Fast start in XO is enabled
0: RC Fast start in XO is disabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_CURMEAS</name>
                <description>This bit is used to force startup of the positive feedback loop in the amplitude detect block of the XO.
1'd1 : startup forced
1'd0 : Normal startup</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_AMPDET_CURMEAS</name>
                <description>This bit can be used to disable all the caps on both X1 node and X2 node.
1'd0 : Caps Enabled
1'd1 : Caps disabled.
Even when all the caps are disabled, due to finite on/off ratio of the caps, the cap on both X1 and X2 node is still 3.69pF</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_AMPDET_FASTSTART</name>
                <description>This bit is used to force startup of the vtnbyr circuit in the biasgen_and_reg block of the XO.
1'd1 : startup forced
1'd0 : Normal startup</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CTRL_RC_FASTSTART_RES</name>
                <description>Controls the time constant with which the surge current from rc_faststart block decays down to zero.
2'd0 : 387us
2'd1 : 309us
2'd2 : 232us
2'd3 : 464us</description>
                <bitRange>[6:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CTRL_VDDL_XO</name>
                <description>Controls the value of supply filter resistance in the xo core. This in turn controls the supply voltage at which the core runs.
3'd0 : 0.769k
3'd1 : 0.877k
3'd2 : 1.023k
3'd3 : 1.152k
3'd4 : 1.413k
3'd5 : 1.537k
3'd6 : 0.376k
3'd7 : 0.559k</description>
                <bitRange>[9:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CTRL_VDDL_XB</name>
                <description>Controls the value of supply filter resistance in the inverter chain. This in turn controls the supply voltage at which the inverter chain runs.
3'd0 : 1.028k
3'd1 : 1.172k
3'd2 : 1.367k
3'd3 : 1.540k
3'd4 : 1.889k
3'd5 : 2.055k
3'd6 : 0.503k
3'd7 : 0.747k</description>
                <bitRange>[12:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CTRL_RPREF</name>
                <description>Controls the reference voltage fed as input to the regulators which generate vdd_xo and vdd_xb.
2'd0 : 1.289V
2'd1 : 1.227V
2'd2 : 1.164V
2'd3 : 1.382V</description>
                <bitRange>[14:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_BB_XO</name>
                <description>N/A</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BB_XO_CAPTRIM</name>
            <description>BB bump configuration 2</description>
            <addressOffset>0x7C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x2D6A</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>X2</name>
                <description>Bits 7-0 together control cap on X2 node.
Bits 6-0 : Fine Control
Value of 6-0 : Cap Value
7'd0 : 3.6900pF
7'd1 : 3.7911pF
7'd2 : 3.8922pF
.
.
.
7'd127 : 16.4280pF
Bit 7 : Coarse control
1'd0 : No additional cap turned on
1'd1 : Additional cap of 8.1pF turned on</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>X1</name>
                <description>Bits 15-8 together control cap on X1 node.
Bits 14-8 : Fine Control
Value of 14-8 : Cap Value
7'd0 : 3.6900pF
7'd1 : 3.7911pF
7'd2 : 3.8922pF
.
.
.
7'd127 : 16.4280pF
Bit 15 : Coarse control
1'd0 : No additional cap turned on
1'd1 : Additional cap of 8.1pF turned on</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SY_BUMP1</name>
            <description>SY bump bits configuration 1</description>
            <addressOffset>0x80</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x505</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>VCO</name>
                <description>Bump bits for SY VCO block.
Rt VCO (2 bits)  - sy_bump1_vco [3:2]
00 ~ 50 Ohms
01 ~ 30 Ohms
10 ~ 22 Ohms
11 ~ 16 Ohms
and Rb VCO (2 bits) - sy_bump1_vco[1:0]
00 ~ 58 Ohms
01 ~ 39 Ohms
10 ~ 22 Ohms
11 ~ 16 Ohms</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOFB_POWERSAVE</name>
                <description>1: enable powersave for LOFB buffer
0: disable powersave for LOFB buffer
This is spare bit in s8blerf_ver2 inside design</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIAS_LOPATH</name>
                <description>bump bits for clkbias in lopath
bump     clk bias pM           clk bias nM
0 0        vddo-vgsp              vgsn
0 1        vddlo-vgsp-100m    vgsn+100m
1 0        vddlo-vgsp-200m    vgsn+200m
1 1        vddlo-vgsp-400m    vgsn+400m</description>
                <bitRange>[6:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LDOLO_FORCE_STARTUP</name>
                <description>1: force start-up of the VT/R circuit in VCOLOPATH LCO
0: no force start-up</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOPATH</name>
                <description>Bump bits for LO path bulk bias. Goes to DIVN/FCAL/LOPATH for bumps. 2 bits for pBulk [3:2] and 2 bits for Divn/Fcal pBulk[1:0].
bump         pBulk
  0  0         vddx-380mV
  0   1        vddx-320mV
  1   0        vddx-440mV
  1   1        vddx</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PDCPLPF</name>
                <description>Bump for PD CP and LPF blocks.[2:0] is used to get range of -20 percentto +15 percent in 5 percent steps.
ICP_BUMP[2:0]          ICP
 1 0 0                             -20 percent
 1 0 1                             -15 percent
 1 1 0                             -10 percent
 1 1 1                             -05 percent
 0 0 0                              00 percent
 0 0 1                              05 percent
 0 1 0                              10 percent
 0 1 1                              15 percent.</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SY_BUMP2</name>
            <description>SY bump bits configuration 2</description>
            <addressOffset>0x84</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>FCAL_BIAS_SEL</name>
                <description>VCTRL bias voltage is selected based on these bits.
Code[1:0]  fcal_bias
    00           Vddvco/2
    01           Vddvco/2 +  5.6 percent(+100mV)
    10           Vddvco/2 -  2.8 percent(-050mV) 
    11           Vddvco/2 -  5.6 percent(-100mV)</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACAP_BIAS_SEL</name>
                <description>ACAP bias voltage is selected based on these bits.
Code[1:0]  acapbias
    00           630mV
    01           700mV
    10           560mV 
    11           595mV</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ICP_XFACTOR</name>
                <description>sy_bump2_icp_xfactor[1]: enable power save for SY FB buffers in TXPOWERSAVE mode, high active
sy_bump2_icp_xfactor[0]: HSDIV2 is put in self oscillation mode, this can be used to find out the process corner of the chip, high active</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ICP_OFFSET</name>
                <description>Bump bits to set the offset pulse width in RX mode
Code[1:0]  delay
00: 2.45ns
01: 1.75ns
10: 1.3ns
11: 25ps</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLKNC_MODE</name>
                <description>Control the NC_clock_mux.
0: The NC clock is given from DIVN once openloop is made low.
1: The NC clock is always connected to Crystal clock</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PUP_MON</name>
                <description>1:Test mode to monitor buffered 1x output on the injmon buffer</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VCTRL_PULLDN</name>
                <description>1: Test mode to pull down for noise simulation</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VMOD_PULLDN</name>
                <description>1: Pull down control for the modulating port</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RST_DLY</name>
                <description>Bumping the reset (up+down) delay.
Code[1:0]  delay
00: 500ps
01: 424ps
10: 350ps
11: 300ps</description>
                <bitRange>[13:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PDCP_OFFSET</name>
                <description>Bump for the bias voltage of the 8x node.
sel[1:0]   R2    Vbp
00         38.5k   925mV  (Default)
01         43.0k   925mV+108mV
10         31.9k   925mV-158mV
11         35.2k   925mV-080mV</description>
                <bitRange>[15:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_BUMP1</name>
            <description>transmit bump configuration 1</description>
            <addressOffset>0x88</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xD030</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>TX_DRIVER</name>
                <description>Driver bias current selection bump bit
tx_bump1_tx_driver[3]   Driver bias current
tx_bump1_tx_driver[2]   PTAT current selection

