cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
Additional Class AB driver bias voltage bump related to Tx_bump2_drv_ab_vbias[3:0]</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_RST_DLY_TX</name>
                <description>Bumping the reset (up+down) delay.
Code[1:0]  delay
00 500ps
01 424ps
10 350ps
11 300ps</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_LPF</name>
                <description>Bump bits for TX LPF op-amp reference voltage [3:2] 
00   Bumps the opamp ref voltage to 400mV
01   Bumps the opamp ref voltage to 450mV 
10   Bumps the opamp ref voltage to 300mV
11   Bumps the opamp ref voltage to 350mVBump bits for TX LPF op-amp bias current
[1:0]
00   Bumps the opamp bias current  to 10u
01   Bumps the opamp bias current  to 12.5u
10   Bumps the opamp bias current  to 8.3u
11   Bumps the opamp bias current  to 7.7u</description>
                <bitRange>[9:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_VTXREF_PROG</name>
                <description>TX Modulation port varactor vtxref bias voltage bump settings
0000  Sets  vtxref value to 100mV
0001  Sets  vtxref value to 150mV
0010  Sets  vtxref value to 200mV
0011  Sets  vtxref value to 250mV
0100  Sets  vtxref value to 300mV
0101  Sets  vtxref value to 350mV
0110  Sets  vtxref value to 400mV
0111  Sets  vtxref value to 450mV
1000  Sets  vtxref value to 500mV
1001  Sets  vtxref value to 550mV
1010  Sets  vtxref value to 600mV
1011 ~ 1111: unused</description>
                <bitRange>[13:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_DIVN_TXPOWERSAVE</name>
                <description>Divn power save bits
pup      freeze   txpowersave&lt;1:0&gt; PupBlocks
  0     0        X          X      NONE
  1     0        X          X     ALL          
  1     1        0          0       ALL       
  1     1        0          1       ALL-D2
  1     1        1          0       ALL-D2-D1
  1     1        1          1       ALL-D2-D1-Buf</description>
                <bitRange>[15:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_BUMP2</name>
            <description>transmit bump configuration 2</description>
            <addressOffset>0x8C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xE338</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DRV_AB_VBIAS</name>
                <description>Bias voltage for the class-AB driver with tx_bump1_tx_driver[1:0]=00
Tx_bump2_drv_ab_vbias[3:0] Vbias_AB , mV
0000                                                    571.224
0001                                                   604.508
0010                                                   626.357
0011                                                   641.856
0100                                                   656.04
0101                                                   667.096
0110                                                   678.775
0111                                                   688.005
1000                                                   698.817
1001                                                   707.272
1010                                                   718.103
1011                                                   726.411
1100                                                   737.995
1101                                                   746.708
1110                                                   759.919
1111                                                   769.735</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DRV_VCASCH</name>
                <description>Programs the driver cascode gate bias voltage

Tx_bump2_drv_vcasch[1:0] Driver cascode bias voltage
00 Vdd_driver - 0.3V
01 Vdd_driver - 0.2V
10 Vdd_driver - 0.1V
11 Vdd_driver</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_LDOBGREF_EN</name>
                <description>Enables a bandgap (low temp coeff) for the 
00 None
01 VCO ldo
10 LOPATH ldo
11 VCO+LOPATH ldo</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_ICP_OFFSET_TX</name>
                <description>Bump bits to set the offset pulse width in TX mode 
Code[1:0]  xfactor
00 : 2.45ns
01 : 1.75ns
10 : 1.3ns
11 : 25ps</description>
                <bitRange>[9:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DAC_RES</name>
                <description>TX DAC load resistor bump settings
0000  DAC output resistor bump by -20 percent
0001  DAC output resistor bump by -17.5 percent
0010  DAC output resistor bump by -15 percent
0011  DAC output resistor bump by -12.5 percent
0100  DAC output resistor bump by -10 percent
0101  DAC output resistor bump by -7.5 percent
0110  DAC output resistor bump by -5 percent
0111  DAC output resistor bump by -2.5 percent
1000  DAC output resistor bump by 0 percent
1001  DAC output resistor bump by 2.5 percent
1010  DAC output resistor bump by 5 percent
1011  DAC output resistor bump by 7.5 percent
1100  DAC output resistor bump by 10 percent
1101  DAC output resistor bump by 12.5 percent
1110  DAC output resistor bump by 15 percent
1111  DAC output resistor bump by 17.5 percent</description>
                <bitRange>[13:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_CP_TXPOWERSAVE</name>
                <description>Charge pump power save bits
pup freeze   txpowersave&lt;1:0&gt; PupBlocks
  0         0     X     X     NONE
  1         0     X      X     ALL          
  1         1     0      0      ALL       
  1         1     0      1      ALL-8x CP
  1         1     1      0     ALL-8x-1x CP
  1         1     1      1     ALL-buffer</description>
                <bitRange>[15:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_BUMP1</name>
            <description>receiver bump configuration 1</description>
            <addressOffset>0x90</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xCA00</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>TIA</name>
                <description>3'b0xx: TIA CM ref voltage 850mV for iref bias current 8.5uA.
3'b1xx: TIA CM ref voltage 850mV for iref bias current 10uA.
3'bx00: TIA OTA CMFB tail current 69uA (Bias current 8.5uA).
3'bx01: TIA OTA CMFB tail current 78uA (Bias current 8.5uA).
3'bx10: TIA OTA CMFB tail current 86uA (Bias current 8.5uA).
3'bx11: TIA OTA CMFB tail current 95uA (Bias current 8.5uA).</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CBPF</name>
                <description>3'b0xx: CBPF CM ref voltage 850mV and 1V for 1st stage and 2nd stage
resp. for irefbg 8.5uA.
3'b1xx: CBPF CM ref voltage 850mV and 1V for 1st stage and 2nd stage
resp. for irefbg 10uA.
3'bxx0: CBPF OTA1 CMFB tail current 17.27uA (Bias current 8.5uA).
3'bxx1: CBPF OTA1 CMFB tail current 21.58uA (Bias current 8.5uA).
3'bx0x: CBPF OTA2 CMFB tail current 17.27uA (Bias current 8.5uA).
3'bx1x: CBPF OTA2 CMFB tail current 21.58uA (Bias current 8.5uA).</description>
                <bitRange>[5:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IF_OFFSET_CALDAC</name>
                <description>Bit Setting Offset DAC LSB
00            132.4nA
01            150.8nA
10            118.0nA
11            106.5nA</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MIXER_VBIAS_SW</name>
                <description>Bump bits for Mixer VBIAS switch
Mixer Bias Programmability
01 TIA CM + 0.38V
00 TIA CM + 0.3V
11 TIA CM + 0.255V
10 TIA CM + 0.17V</description>
                <bitRange>[9:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MIXER</name>
                <description>bump bits to control LNA gate bias voltage in RX mode
01      0.5V
00      0.4V
11      0.3V
10      0.2V</description>
                <bitRange>[11:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LNA</name>
                <description>rx_bump1_lna[3]
1: enables the HG and LG LNA section's cascode biases to be alive independent of whether LNA is HG or LG mode. This enables fast transition from LG to HG in AGC events
rx_bump1_lna[2]
1: forces pull donwn of inputs of LNA (post AC coupling) if LNA is powered up in Hi-Z mode to ensure good isolation during DC offset calibration of Receiver chain
rx_bump1_lna[1]
1: Boost the LNA bias current ot HP equivalent (1.5mA current penalty) if LNA gain is at 101 (66dB setting) and this bit is set. this boosts sensitivity by 2-3dB but the hit in the current consumption is only at 66dB gain setting. so average current comsumption in field should not be impacted much but a 2dB boost in sensitivity is seen
rx_bump1_lna[0]
1: Forces the TIA to have lower feedback resistor to aviode EVM degratation in the TIA dut to complex filter distortion caused by I/Q cross talk if feedback resistors is high in the TIA</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_BUMP2</name>
            <description>receiver bump configuration 2</description>
            <addressOffset>0x94</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x8CE</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>LNA_IBIAS</name>
                <description>Bump bits for PTAT bias currents of LNA (Default is 00). Play with these to enable Low Power and Ultra Low Power modes in the LNA.
01 IBias+15 percent
00 IBias+0 percent (Default)
11 IBias-25 percent
10 IBias-50 percent</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TIA_IBIAS</name>
                <description>Bump bits for RCAL bias currents of the TIA and the CBPF amplifiers (Default is 11 for current saving).
01 IBias+15 percent
00 IBias+0 percent
11 IBias-15 percent (Default)
10 IBias-20 percent</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CBPF_IBIAS</name>
                <description>Bump bits for BGR bias currents of Offset Calibration DAC (Default is 00)
01 IBias+15 percent
00 IBias_0 percent (Default)
11 IBias-15 percent
10 IBias-20 percent</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IF_CM_IBIAS</name>
                <description>Bump bits for Common mode setting currents of the TIA and the CBPF amplifiers (Default is 11 for current saving).
01 IBias+15 percent
00 IBias+0 percent
11 IBias-15 percent (Default)
10 IBias-20 percent</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CBPF_HIZ_ENABLE</name>
                <description>Setting this bit to 1 configures the CBPF output as hi-Z enabling independent ADC testing with the injection system</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COMPLEX_DISABLE</name>
                <description>setting this bit to disables the complex operation for the band pass filter configuring it as two low pass filters</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_R2HIGHMODE</name>
                <description>Enables a higher R2 mode for loop stabilization with low Kv and debug mode.
0 - 40 kohms
1 - 60 kohms</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_HILINEARITYR2_MODE</name>
                <description>Switches the RX mode between settings used in TX vs a higher linearity setting.
0 - Use same as TX
1 - Use alternative bias for RX. Effective only in RX mode. This is don't care in TX mode</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_LOWKVAMODE</name>
                <description>Enables a lower Kv/2 mode
0 - 70 MHz/V
1 - 45 MHz/V</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SY_LOWKVMMODE</name>
                <description>Enables a lower Kv/2 mode
0 - 10 MHz/V
1 - 5 MHz/V</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_RX_BUMP2</name>
                <description>N/A</description>
                <bitRange>[15:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_BUMP1</name>
            <description>ADC1 bump configuration</description>
            <addressOffset>0x98</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x24</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>I_REF</name>
                <description>Bump bits for the channel-I reference voltage. (2's complement interpretation) Every bit changes the reference voltage by 10mV. See the above table</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>Q_REF</name>
                <description>Bump bits for the channel-Q reference voltage. (2's complement interpretation) Every bit changes the reference voltage by 10mV. 
100 610 mV
000 650 mV
011 680 mV</description>
                <bitRange>[5:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IBG_CAL</name>
                <description>Bump bits for the preamp's bias current.
X00 + 0  percent ( Ibias - 0 uA)
X01 +25  percent ( Ibias - 12.5 uA)
X10 - 50  percent ( Ibias - 5 uA)
X11 - 25  percent ( Ibias - 7.5 uA)</description>
                <bitRange>[8:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOOPDLY</name>
                <description>Loop delay control in SAR return path. 
00 Min delay
11 Max delay</description>
                <bitRange>[10:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOOPDLY4X_EN</name>
                <description>Loop delay increment by 4x in SAR return path 
0 Delay determined by loopdly[1:0] 
1 4x the delay dictated by the said bit</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOWPOWER</name>
                <description>rCurrent reduction mode in the reference generator.  
0  No bump
1 50 percent bump</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OPAMP_BYPASS</name>
                <description>Bypass op-amp and diode connect reference generator's servo loop 
0  Op-amp enabled
1 Op-amp bypassed</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BWCTRL</name>
                <description>Reference generator's bandwidth boost by injecting current in the output arm. 
Injection Current :
00           0 uA
01           20 uA
10           40 uA
11           60 uA</description>
                <bitRange>[15:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADC_BUMP2</name>
            <description>ADC 2 bump configuration</description>
            <addressOffset>0x9C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x4</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CYCLE_B2_DELAY</name>
                <description>Enable redundant conversion cycle at b2 position. 
0 Enabled
1 Disabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CYCLE_B5_DELAY</name>
                <description>Enable redundant conversion cycle at b5 position.
0 Disabled
1 Enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DUTCYCLE_25</name>
                <description>Clock duty cycle control 
0 50  percent time for track phase  &amp; 50  percent  time for convert phase
1 25  percent time for track phase &amp; 75  percent  time for convert phase</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>METADET_EN</name>
                <description>Enable meta detection</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IBUMP</name>
                <description>0: 6dB attenuation in CBPF gain only at lowest gain setting to improve the Max signal level the receiver can tolarate
Note: in order to chare the tub width with AGC disabled, this back off mode is effective only with AGC profile set to rev** mode. This is in reg0xa4[3] which needs to be set to '0' for rev** profile</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PREAMP_SOURCECTRL_N</name>
                <description>Disconnect source coupled node of the preamp during track phase. 
0 Functionality enabled
1 Functionality disabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PREAMP_GAINCTRL_N</name>
                <description>Enable preamp's low/high gain modes over conversion cycle.
0 Functionality enabled
1 Functionality disabled</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SHORT_INPUT</name>
                <description>Put the ADC in idle channel mode. Inputs are shorted to locally generated 1V signal.
0 Normal operation
1 Idle channel mode</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RETURN_SKEW</name>
                <description>Delaying the sampling clock from the comparator wrt to the data. 
000 Min delay
111 Max delay</description>
                <bitRange>[10:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IQSWAP</name>
                <description>Swaps the I and Q channel Vbg/R for ref.gen
0 No swap
1 Enable swapping</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PREAMP_BWCTRL</name>
                <description>Bandwidth bump bits for the preamp. Each bit connects a 5fF cap to the output nodes. No cap is connected by default</description>
                <bitRange>[13:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_ADC_BUMP2</name>
                <description>[1] -- not used
[0] - Enable clean Vdd for the cascodes &amp; op-amp in refgen. The clean Vdd supplied through the diag. ( Diag code = 0101 for channel I and Diag code =1101 for channel Q). Default connection to the internal Vdd</description>
                <bitRange>[15:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
