cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
          <register>
            <name>BALUN</name>
            <description>BALUN bump configuration</description>
            <addressOffset>0xA0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>BUMP_RX_CTUNE</name>
                <description>Programmable bits to change tuning capacitance in the Balun primary side in RX operation
Balun_bump_tx_ctune[3:0] Ctune, fF
0000                                           42.5
0001                                           48.8
0010                                           55.1
0011                                           61.4
0100                                           67.7
0101                                           74
0110                                           80.3
0111                                           86.6
1000                                           92.9
1001                                           99.2
1010                                           105.5
1011                                           111.8
1100                                           118.1
1101                                           124.4
1110                                           130.7
1111                                           137</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUMP_TX_CTUNE</name>
                <description>Programmable bits to change tuning capacitance in the Balun primary side in TX operation
Balun_bump_tx_ctune[3:0] Ctune, fF
0000                                           42.5
0001                                           48.8
0010                                           55.1
0011                                           61.4
0100                                           67.7
0101                                           74
0110                                           80.3
0111                                           86.6
1000                                           92.9
1001                                           99.2
1010                                           105.5
1011                                           111.8
1100                                           118.1
1101                                           124.4
1110                                           130.7
1111                                           137</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUMP_VTUNE</name>
                <description>resereved for feature</description>
                <bitRange>[10:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUMP_RTUNE</name>
                <description>resereved for feature</description>
                <bitRange>[12:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_BALUN</name>
                <description>resereved for feature</description>
                <bitRange>[15:13]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR1</name>
            <description>RFCTRL control timing 1</description>
            <addressOffset>0xA4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x31C0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>VCO_WARMUP_TIME</name>
                <description>vco warm up time, 1: 10us, 0: 5us</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PLL_SETTLING_TIME</name>
                <description>PLL setting time
00: 25us, 01: 30us, 10: 40us, 11:50us</description>
                <bitRange>[2:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FREEZE_TIME</name>
                <description>tx freeze time
00: 30us, 01: 40us, 10: 50us, 11: 25us</description>
                <bitRange>[4:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_PREDRV_TIME</name>
                <description>PA predrive pup time, 
1:powered up after LDO, 0: powered up after KVCAL</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_MODSTART_TIME</name>
                <description>this controls the time between the PUP_TX_DRIVER going high and when f_n_txen is asserted.
00: 0us, 01: 1us, 10: 2us, 11, 3us</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_DF2_SEL</name>
                <description>0: DF2 Max frequency deviation as 224KHz
1: DF2 Max frequency deviation as 242KHz</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADC_FULL_SWING_MONI_EN</name>
                <description>when ctr1_adc_full_swing_moni_en is set and ctr1_dbg_select is 2'b11. ADC full swing detection can be monitored in debug pin</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DBG_SELECT</name>
                <description>00: demod soft reset / AGC reset,
01: AGC FSM MSB and f_n_rxen
10: gain decrease and gain increase.
11: ADC full swing detection and ADC saturation detected signal</description>
                <bitRange>[11:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_DC_FREEZE_EN</name>
                <description>demodulation soft reset to DC cancellation enabled, high active</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_ENV_FREEZE_EN</name>
                <description>demodulation soft reset to frequency tracking enabled, high active</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGC_RST_DLY</name>
                <description>00: 0.25us delay; 01: 1.25us delay, 10: 2.25us delay, 11: 3.25us delay</description>
                <bitRange>[15:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AGC</name>
            <description>AGC timing conifguration</description>
            <addressOffset>0xA8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x25FF</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RST_EN</name>
                <description>1: AGC soft reset enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHECK_SAT_EN</name>
                <description>1: quick check saturated ADC
0: mearue ADC power at fixed period</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SAT_CHK_TIM</name>
                <description>ADC saturated detection timing
0: 3 12MHz clock;1:3 12MHz clock;</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GAIN_MAPPING_MODE</name>
                <description>0: Atlantis TC rev** gaim mapping
1: Atlantis TC revA gain mapping</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GAIN_SAT_THRES</name>
                <description>ADC saturated detection threshold for doing a fast transition
00: 0dBm; 01: 1dBm; 10: 2dBm, 11: 3dBm</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PWR_MEAS_TIM</name>
                <description>AGC power measurement time
11: 1us, 10: 0.75us, 01: 0.5us, 00:0.25us</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GAIN_STABLE_TIM</name>
                <description>gain stable time after gain assignment.
1 represents one 12Mhz clock</description>
                <bitRange>[12:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>START_WAIT_TIM</name>
                <description>start AGC waiting time when RFCTRL set AGC enable
1 represents 1us, base 1us</description>
                <bitRange>[15:13]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>THRSHD1</name>
            <description>AGC step threshold 1</description>
            <addressOffset>0xAC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3C2C</resetValue>
            <resetMask>0x3F3F</resetMask>
            <fields>
              <field>
                <name>AGC60_66</name>
                <description>threshold gain changge from 66dB to60dB</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGC66_60</name>
                <description>threshold gain changge from 60dB to 48dB</description>
                <bitRange>[13:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>THRSHD2</name>
            <description>AGC step threshold 2</description>
            <addressOffset>0xB0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3B2A</resetValue>
            <resetMask>0x3F3F</resetMask>
            <fields>
              <field>
                <name>AGC48_60</name>
                <description>threshold gain changge from 60dB to48dB</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGC60_48</name>
                <description>threshold gain changge from 48dB to 60dB</description>
                <bitRange>[13:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>THRSHD3</name>
            <description>AGC step threshold 3</description>
            <addressOffset>0xB4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3B2C</resetValue>
            <resetMask>0x3F3F</resetMask>
            <fields>
              <field>
                <name>AGC36_48</name>
                <description>threshold gain changge from 48dB to 36dB</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGC48_36</name>
                <description>threshold gain changge from 366dB to 48dB</description>
                <bitRange>[13:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>THRSHD4</name>
            <description>AGC step threshold 4</description>
            <addressOffset>0xB8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3C2B</resetValue>
            <resetMask>0x3F3F</resetMask>
            <fields>
              <field>
                <name>AGC18_36</name>
                <description>threshold gain changge from 36dB to 18dB</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGC36_18</name>
                <description>threshold gain changge from 18dB to 36dB</description>
                <bitRange>[13:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>THRSHD5</name>
            <description>AGC step threshold 5</description>
            <addressOffset>0xBC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3E26</resetValue>
            <resetMask>0x3F3F</resetMask>
            <fields>
              <field>
                <name>AGC0_18</name>
                <description>threshold for gain change from 18dB to 0dB</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGC18_0</name>
                <description>threshold for gain change from 0dB to 18dB</description>
                <bitRange>[13:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DC</name>
            <description>ADC I/Q DC compensate value</description>
            <addressOffset>0xC0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>COMP_Q_CODE</name>
                <description>this code is removed from the ADC I output.
This field can be progamrmed to remove systematci DC offset</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COMP_I_CODE</name>
                <description>this code is removed from the ADC Q output.
This field can be progamrmed to remove systematci DC offset</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IQMIS</name>
            <description>IQ mismatch correction value</description>
            <addressOffset>0xC4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>IQCOMP_QVAL</name>
                <description>I-component of the IQ mismatch correction</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IQCOMP_IVAL</name>
                <description>Q-component of the IQ mismatch correction</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DCCAL</name>
            <description>DC CAL and setting</description>
            <addressOffset>0xC8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>TEST_IBITS</name>
                <description>this value is driven to DCCAL Icode if the DCCA: test mode enabled</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_QBITS</name>
                <description>this value is driven to DCCAL Qcode if the DCCA: test mode enabled</description>
                <bitRange>[11:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_MODE</name>
                <description>enable the DCCAL test mode</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_Q_POLARITY</name>
                <description>1: inverts the polarity of DCCAL Q code</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TEST_I_POLARITY</name>
                <description>1: inverts the polarity of DCCAL I code</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RCCAL</name>
            <description>TX LPF and TIA/CBPF RC code</description>
            <addressOffset>0xCC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x1A10</resetValue>
            <resetMask>0xFBFF</resetMask>
            <fields>
              <field>
                <name>CODE_RX</name>
                <description>force RC code for TIA/CBPF under test mode</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CODE_TX</name>
                <description>force RC code for TX LPF under test mode</description>
                <bitRange>[9:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SOFTRST_POWER_DIFF</name>
                <description>soft reset power change detection, 1: 12dB, 0:6dB</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SOFTRST_EN_TOSTR</name>
                <description>soft reset is enabled to STR block</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SOFTRST_EN_TODIFF</name>
                <description>soft reset is enable to diffdet block</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGC_GAIN_INC_TIMES_THRES</name>
                <description>AGC gain increase requirement wait times:
00: respose for 1st gain increase request
01: respone for 2nd gain increase request
10: respons for 3rd gain increase request
11: respons for 4th gain increase request</description>
                <bitRange>[15:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSM1</name>
            <description>DSM freeze code 1</description>
            <addressOffset>0xD0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xD964</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>INDX_CODE3</name>
                <description>index at which DSM code should be freezed when fection value = 3/24</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE2</name>
                <description>index at which DSM code should be freezed when fection value = 2/24</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE1</name>
                <description>index at which DSM code should be freezed when fection value = 1/24</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE0</name>
                <description>index at which DSM code should be freezed when fection value = 0</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSM2</name>
            <description>DSM freeze code 2</description>
            <addressOffset>0xD4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x54C1</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>INDX_CODE7</name>
                <description>index at which DSM code should be freezed when fection value = 7/24</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE6</name>
                <description>index at which DSM code should be freezed when fection value = 6/24</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE5</name>
                <description>index at which DSM code should be freezed when fection value = 5/24</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE4</name>
                <description>index at which DSM code should be freezed when fection value = 4/24</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
