cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
          <register>
            <name>DSM3</name>
            <description>DSM freeze code 3</description>
            <addressOffset>0xD8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xAAA5</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>INDX_CODE11</name>
                <description>index at which DSM code should be freezed when fection value = 11/24</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE10</name>
                <description>index at which DSM code should be freezed when fection value = 10/24</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE9</name>
                <description>index at which DSM code should be freezed when fection value = 9/24</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE8</name>
                <description>index at which DSM code should be freezed when fection value = 8/24</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSM4</name>
            <description>DSM freeze code 4</description>
            <addressOffset>0xDC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x8911</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>INDX_CODE15</name>
                <description>index at which DSM code should be freezed when fection value = 15/24</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE14</name>
                <description>index at which DSM code should be freezed when fection value = 14/24</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE13</name>
                <description>index at which DSM code should be freezed when fection value = 13/24</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE12</name>
                <description>index at which DSM code should be freezed when fection value = 12/24</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSM5</name>
            <description>DSM freeze code 5</description>
            <addressOffset>0xE0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x9D37</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>INDX_CODE19</name>
                <description>index at which DSM code should be freezed when fection value = 19/24</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE18</name>
                <description>index at which DSM code should be freezed when fection value = 18/24</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE17</name>
                <description>index at which DSM code should be freezed when fection value = 17/24</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE16</name>
                <description>index at which DSM code should be freezed when fection value = 16/24</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSM6</name>
            <description>DSM freeze code 6</description>
            <addressOffset>0xE4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x788C</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>INDX_CODE23</name>
                <description>index at which DSM code should be freezed when fection value = 23/24</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE22</name>
                <description>index at which DSM code should be freezed when fection value = 22/24</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE21</name>
                <description>index at which DSM code should be freezed when fection value = 21/24</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INDX_CODE20</name>
                <description>index at which DSM code should be freezed when fection value = 20/24</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONI</name>
            <description>agc gain and pup signal monitor</description>
            <addressOffset>0xE8</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0xBC00</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PUP_SIG</name>
                <description>block pup up signals monitor.
10: iso_eanble
9: balum LDO power up, high active
8: SY bias power up, high active
7. SY VCO pup up, high active
6: TX bias pup up, high active
5. TX DAC pup up, high active
4: TX LPF pup up, high active
3. TX driver pup up, high active
2: RX LNA pup up, high active
1. RX CBPF pup up, high active
0: RX ADC ICORE pup, high active</description>
                <bitRange>[10:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CBPF_CODE</name>
                <description>cbpf gain code read back</description>
                <bitRange>[12:11]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>LNA_CODE</name>
                <description>lna gain code read back</description>
                <bitRange>[15:13]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBG_BB</name>
            <description>RX offcal and RC cal code</description>
            <addressOffset>0xEC</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RX_OFFSET_Q_CODE</name>
                <description>when modem_read_dc_offset_sel = 1, RX DCCAL Q path can be read through this field.
When modem_read_dc_offset_sel = 0, RC DC offset capture Q code can be read through this field
rx offsetcal Q code can be read through this field if modem_read_dc_offset_sel = 0</description>
                <bitRange>[7:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_OFFSET_I_CODE</name>
                <description>when modem_read_dc_offset_sel = 1, RX DCCAL I path can be read through this field.
When modem_read_dc_offset_sel = 0, RC DC offset capture I code can be read through this field
rx offsetcal Q code can be read through this field if modem_read_dc_offset_sel = 0</description>
                <bitRange>[15:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBG_1</name>
            <description>FCAL coarse / fine code is reflected in this field</description>
            <addressOffset>0xF0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x808</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>FCAL_FINE_CODE</name>
                <description>The FCAL fine code is reflected in this field</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>FCAL_COARSE_CODE</name>
                <description>The FCAL coars code is reflected in this field</description>
                <bitRange>[11:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>FCAL_DONE</name>
                <description>1: indicates when frequency calibration is done</description>
                <bitRange>[12:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>KVCAL_DONE</name>
                <description>1: indicates TX KV calibration is done for current packet</description>
                <bitRange>[13:13]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DCCAL_DONE</name>
                <description>1: indicates RX DC calibration is done for current packet</description>
                <bitRange>[14:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBG_2</name>
            <description>FCAL countere value ate the end of 7th bit (MSB)</description>
            <addressOffset>0xF4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>FCAL_CNT_LSB</name>
                <description>the dbg_fcal_cnt_sel value, the 16 LSB bits of the corresponding debug counter is pouplated in this register
[6:0] is kvcal_gain when select kvcal_gain</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DBG_3</name>
            <description>VCO OL count read out (MSB)</description>
            <addressOffset>0xF8</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFC0F</resetMask>
            <fields>
              <field>
                <name>FCAL_CNT_MSB</name>
                <description>the dbg_fcal_cnt_sel value, the 4 MSB bits of the corresponding debug counter is pouplated in this register</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RD_RCCAL_CODE</name>
                <description>RCCAL code read out through register</description>
                <bitRange>[14:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RD_RCCAL_DONE</name>
                <description>RCCAL done indictor</description>
                <bitRange>[15:15]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>READ_IQ_1</name>
            <description>I&amp;Q Path ADC Data</description>
            <addressOffset>0x100</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADC_1</name>
                <description>read out I&amp;Q path ADC data, first 16bits of I and Qcombination of 63bits</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>READ_IQ_2</name>
            <description>I&amp;Q Path ADC Data</description>
            <addressOffset>0x104</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADC_2</name>
                <description>read out I&amp;Q path ADC data, second 16bits of I and Qcombination of 63bits</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>READ_IQ_3</name>
            <description>I&amp;Q Path ADC Data</description>
            <addressOffset>0x108</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADC_3</name>
                <description>read out I&amp;Q path ADC data, third 16bits of I and Qcombination of 63bits</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>READ_IQ_4</name>
            <description>I&amp;Q Path ADC Data</description>
            <addressOffset>0x10C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADC_4</name>
                <description>read out I&amp;Q path ADC data, fourth 15bits of I and Qcombination of 63bits</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>BLELL</name>
          <description>Bluetooth Low Energy Link Layer</description>
          <addressOffset>0x00001000</addressOffset>
          <register>
            <name>COMMAND_REGISTER</name>
            <description>Instruction Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>COMMAND</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENT_INTR</name>
            <description>Event(Interrupt) status and Clear register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7F</resetMask>
            <fields>
              <field>
                <name>ADV_INTR</name>
                <description>Advertiser interrupt. If bit is set to 1, it indicates an event occurred in the advertising procedure. The source of the event needs to be read from the ADV_INTR register.  
This bit is cleared, when firmware clears ALL interrupts by writing to the ADV_INTR register.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SCAN_INTR</name>
                <description>Scanner interrupt.  If bit is set to 1, it indicates an event occurred in the scanning procedure. The source of the event needs to be read from the SCAN_INTR register.   
This bit is cleared, when firmware clears ALL interrupts by writing to the SCAN_INTR register.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INIT_INTR</name>
                <description>Initiator interrupt.  If bit is set to 1, it indicates an event occurred in the initiating procedure. The source of the event needs to be read from the INIT_INTR register.   
This bit is cleared, when firmware clears ALL interrupts by writing to the INIT_INTR register.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CONN_INTR</name>
                <description>Connection interrupt.  If bit is set to 1, it indicates an event occurred in the connection operation. This interrupt is aggregation of interrupts for all the connections. The source of the event for the specific connection, needs to be read from the CONN_INTR register specific to the connection. This bit is cleared, when firmware clears ALL interrupts by writing to the CONN_INTR register.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM_INTR</name>
                <description>Read: Sleep-mode-exit interrupt. This bit is set, when link layer hardware exits from sleep mode. 
Write: Clear sleep-mode-exit interrupt. Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_INTR</name>
                <description>Read: Deep sleep mode exit interrupt. This bit is set, when link layer hardware exits from deep sleep mode. 
Write: Clear deep sleep mode exit interrupt. Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENC_INTR</name>
                <description>Encryption module interrupt.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EVENT_ENABLE</name>
            <description>Event indications enable.</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7F</resetMask>
            <fields>
              <field>
                <name>ADV_INT_EN</name>
                <description>Advertiser interrupt enable.
1 - enable advertiser procedure to interrupt the firmware.
0 - disable advertiser procedure interrupt to firmware.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCN_INT_EN</name>
                <description>Scanner interrupt enable.
1 - enable scan procedure to interrupt the firmware.
0 - disable scan procedure interrupt to firmware.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_INT_EN</name>
                <description>Initiator interrupt enable.
1 - enable initiator procedure to interrupt the firmware.
0 - disable initiator procedure interrupt to firmware.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_INT_EN</name>
                <description>Connection interrupt enable. 
1 - enable connection procedure to interrupt the firmware.
0 - disable connection procedure interrupt to firmware.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM_INT_EN</name>
                <description>Sleep-mode-exit interrupt enable.  
1 - enable sleep mode exit event to interrupt the firmware.
0 - disable sleep mode exit interrupt to firmware.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_INT_EN</name>
                <description>Deep Sleep-mode-exit interrupt enable.  
1 - enable deep sleep mode exit event to interrupt the firmware.
0 - disable deep sleep mode exit interrupt to firmware.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENC_INT_EN</name>
                <description>Encryption module interrupt enable.  
1 - Enable encryption module interrupt to firmware.
0 - disable encryption module interrupt to firmware.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
