cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
          <register>
            <name>ADV_PARAMS</name>
            <description>Advertising parameters register.</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xE0</resetValue>
            <resetMask>0x85FF</resetMask>
            <fields>
              <field>
                <name>TX_ADDR</name>
                <description>Device own address type. 
1 - Address type is random. 
0 - Address type is public.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_TYPE</name>
                <description>The Advertising type is used to determine the packet type that is used for advertising when advertising is enabled. 
0x0 - Connectable undirected advertising. (adv_ind) 
0x1 - Connectable directed advertising (adv_direct_ind). 
0x2 - Discoverable undirected advertising (adv_discover_ind) 
0x3 - Non connectable undirected advertising (adv_nonconn_ind).</description>
                <bitRange>[2:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_FILT_POLICY</name>
                <description>Advertising filter policy. The set of devices that the advertising procedure uses for device filtering is called the White List. 
0x0 - Allow scan request from any device, allow connect request from any device. 
0x1 - Allow scan request from devices in white list only, allow connect request from any device. 
0x2 - Allow scan request from any device, allow connect request from devices in white list only. 
0x3 - Allow scan request from devices in white list only, allow connect request from devices in white list only.</description>
                <bitRange>[4:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_CHANNEL_MAP</name>
                <description>Advertising channel map indicates the advertising channels used for advertising. By setting the bit, corresponding channel is enabled for use. Atleast one channel bit should be set.  
7 - enable channel 39. 
6 - enable channel 38. 
5 - enable channel 37.</description>
                <bitRange>[7:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_ADDR</name>
                <description>Peer addresses type. This is the Direct_Address_type field programmed, only if ADV_DIRECT_IND type is sent.
1 - Rx addr type is random.
0 - Rx addr type is public</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_LOW_DUTY_CYCLE</name>
                <description>This bit field is used to specify to the Controller the Low Duty Cycle connectable directed advertising variant being used.
1 - Low Duty Cycle Connectable Directed Advertising.
0 - High Duty Cycle Connectable Directed Advertising.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RCV_TX_ADDR</name>
                <description>Transmit address field of the received packet extracted from the receive packet. This field is used by firmware to report peer_addr_type parameter in the connection complete event.</description>
                <bitRange>[15:15]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_INTERVAL_TIMEOUT</name>
            <description>Advertising interval register.</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x20</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>ADV_INTERVAL</name>
                <description>Range:  0x0020 to 0x4000 (For ADV_IND) 
0x00A0 to 0x4000 (For ADV_SCAN_IND and NONCONN_IND) 
Invalid for ADV_DIRECT_IND 
Time = N * 0.625 msec 
Time Range: 20 ms to 10.24 sec. 
For directed advertising, firmware programs the default value of 1.28 seconds.</description>
                <bitRange>[14:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_INTR</name>
            <description>Advertising interrupt status and Clear register</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1FF</resetMask>
            <fields>
              <field>
                <name>ADV_STRT_INTR</name>
                <description>If this bit is set it indicates a new advertising event started after interval expiry.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_CLOSE_INTR</name>
                <description>If this bit is set it indicates current advertising event is closed.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_TX_INTR</name>
                <description>If this bit is set it indicates ADV packet is transmitted. 
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_RSP_TX_INTR</name>
                <description>If this bit is set it indicates scan response packet transmitted in response to previous scan request packet received.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_REQ_RX_INTR</name>
                <description>If this bit is set it indicates scan request packet received.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_REQ_RX_INTR</name>
                <description>If this bit is set it indicates connect request packet is received.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SLV_CONNECTED</name>
                <description>If this bit is set it indicates that connection is created as slave. 
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_TIMEOUT</name>
                <description>If this bit is set it indicates that the directed advertising event has timed out after 1.28 seconds. Applicable in adv_direct_ind advertising. 
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_ON</name>
                <description>Advertiser procedure is ON in hardware. Indicates that advertiser procedure is ON in hardware.
1 - ON
0 - OFF</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_NEXT_INSTANT</name>
            <description>Advertising next instant.</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ADV_NEXT_INSTANT</name>
                <description>Shows the next start of advertising event with reference to the internal reference clock.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SCAN_INTERVAL</name>
            <description>Scan Interval Register</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x10</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SCAN_INTERVAL</name>
                <description>Scan interval register. Interval between two consecutive scanning events. Firmware sets the scanning interval value to this register before issuing start scan command.
Range: 0x0004 to 0x4000 
Default: 0x0010 (10 ms) 
Time = N * 0.625 msec  
Time Range: 2.5 msec to 10.24 sec.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SCAN_WINDOW</name>
            <description>Scan window Register</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x10</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SCAN_WINDOW</name>
                <description>Duration of scan in a scanning event, which should be less than or equal to scan interval value. Firmware sets the scan window value to this register before issuing start scan command.
Range: 0x0004 to 0x4000 
Default: 0x0010 (10 ms) 
Time = N * 0.625 msec  
Time Range: 2.5 msec to 10.24 sec.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SCAN_PARAM</name>
            <description>Scanning parameters register</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>TX_ADDR</name>
                <description>Device's own address type. 
1 - addr type is random. 
0 - addr type is public.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_TYPE</name>
                <description>0x00 - passive scanning.(default) 
0x01 - active scanning. 
0x10 - RFU 
0x11 - RFU</description>
                <bitRange>[2:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_FILT_POLICY</name>
                <description>The scanner filter policy determines how the scanner processes advertising packets. 
0x00 - Accept advertising packets from any device. 
0x01 - Accept advertising packets from only devices in the whitelist. 
0x10 - RFU 
0x11 - RFU 
Adv_direct_ind packets which are not addressed to this device are ignored.</description>
                <bitRange>[4:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DUP_FILT_EN</name>
                <description>Filter duplicate packets.
1- Duplicate filtering enabled. 
0- Duplicate filtering not enabled.
This field is derived from the LE_set_scan_enable command.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SCAN_INTR</name>
            <description>Scan interrupt status and Clear register</description>
            <addressOffset>0x38</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x11F</resetMask>
            <fields>
              <field>
                <name>SCAN_STRT_INTR</name>
                <description>If this bit is set it indicates scan window is opened.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_CLOSE_INTR</name>
                <description>If this bit is set it indicates scan window is closed.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_TX_INTR</name>
                <description>If this bit is set it indicates scan request packet is transmitted. 
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_RX_INTR</name>
                <description>If this bit is set it indicates ADV packet received. Firmware can read the content of the packet from the INIT_SCN_ADV_RX_FIFO.
Write to the register with this bit set to 1, clears the interrupt source.
This interrupt is generated while active/passive scanning upon receiving adv packets.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_RSP_RX_INTR</name>
                <description>If this bit is set it indicates SCAN_RSP packet is received. Firmware can read the content of the packet from the INIT_SCN_ADV_RX_FIFO.
Write to the register with this bit set to 1, clears the interrupt source. 
NOTE: This interrupt is generated while active scanning upon receiving scan response packet.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_ON</name>
                <description>Scan procedure status. 
1 - scan procedure is active. 
0 - scan procedure is not active.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SCAN_NEXT_INSTANT</name>
            <description>Advertising next instant.</description>
            <addressOffset>0x3C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>NEXT_SCAN_INSTANT</name>
                <description>Shows the instant with respect to internal reference clock of resolution 625 us at which next scanning  event begins.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INIT_INTERVAL</name>
            <description>Initiator Interval Register</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>INIT_SCAN_INTERVAL</name>
                <description>Initiator interval register. Firmware sets the initiator's scanning interval value to this regis-ter before issuing create connection command. Interval between two consecutive scanning events.
Range: 0x0004 to 0x4000 
Time = N * 0.625 msec  
Time Range: 2.5 msec to 10.24 sec.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INIT_WINDOW</name>
            <description>Initiator window Register</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>INIT_SCAN_WINDOW</name>
                <description>Duration of scan in a scanning event, which should be less than or equal to scan interval value. Firmware sets the scan window value to this register before issuing create connection command.
Range: 0x0004 to 0x4000 
Time = N * 0.625 msec  
Time Range: 2.5 msec to 10.24 sec.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INIT_PARAM</name>
            <description>Initiator parameters register</description>
            <addressOffset>0x48</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xB</resetMask>
            <fields>
              <field>
                <name>TX_ADDR</name>
                <description>Device' own address type. 
1 - addr type is random. 
0 - addr type is public.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_ADDR__RX_TX_ADDR</name>
                <description>Peer address type.
The rx_addr field is updated by the receiver with the address type of the received connectable advertising packet.
1 - addr type is random. 
0 - addr type is public.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_FILT_POLICY</name>
                <description>The Initiator_Filter_Policy is used to determine whether the White List is used or not.
0 - White list is not used to determine which advertiser to connect to. Instead the Peer_Address_Type and Peer Address fields are used to specify the address type and address of the advertising device to connect to.
1 - White list is used to determine the advertising device to connect to.
Peer_Address_Type and Peer_Address fields are ignored when whitelist is used.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INIT_INTR</name>
            <description>Scan interrupt status and Clear register</description>
            <addressOffset>0x50</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x17</resetMask>
            <fields>
              <field>
                <name>INIT_INTERVAL_EXPIRE_INTR</name>
                <description>If this bit is set it indicates initiator scan window has started.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_CLOSE_WINDOW_INR</name>
                <description>If this bit is set it indicates initiator scan window has finished.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_TX_START_INTR</name>
                <description>If this bit is set it indicates initiator packet (CONREQ) transmission has started.
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MASTER_CONN_CREATED</name>
                <description>If this bit is set it indicates connection is created as master. 
Write to the register with this bit set to 1, clears the interrupt source.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INIT_NEXT_INSTANT</name>
            <description>Initiator next instant.</description>
            <addressOffset>0x54</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>INIT_NEXT_INSTANT</name>
                <description>Shows the instant with respect to internal reference clock of resolution 625 us at which next initiator scanning event begins.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICE_RAND_ADDR_L</name>
            <description>Lower 16 bit random address of the device.</description>
            <addressOffset>0x58</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DEVICE_RAND_ADDR_L</name>
                <description>Lower 16 bit of 48-bit random address of the device.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
