cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
          <register>
            <name>SCAN_CONFIG</name>
            <description>Scan configuration register</description>
            <addressOffset>0x1D8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xE01F</resetValue>
            <resetMask>0xE81F</resetMask>
            <fields>
              <field>
                <name>SCN_STRT_EN</name>
                <description>Enable scan event start interrupt.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCN_CLOSE_EN</name>
                <description>Enable scan event close interrupt.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCN_TX_EN</name>
                <description>Enable scan request packet transmitted interrupt.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADV_RX_EN</name>
                <description>Enable adv packet received interrupt .</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCN_RSP_RX_EN</name>
                <description>Enable scan_rsp packet received  interrupt .</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BACKOFF_ENABLE</name>
                <description>Enable random backoff feature in scanner.
1 - enable
0 - disable</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCAN_CHANNEL_MAP</name>
                <description>Advertising channels that are enabled for scanning operation.
Bit 15: setting 1 - enables channel 39 for use.
Bit 14: setting 1 - enables channel 38 for use.
Bit 13: setting 1 - enables channel 37 for use.</description>
                <bitRange>[15:13]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INIT_CONFIG</name>
            <description>Initiator configuration register</description>
            <addressOffset>0x1DC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xE017</resetMask>
            <fields>
              <field>
                <name>INIT_STRT_EN</name>
                <description>Enable Initiator event start interrupt.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_CLOSE_EN</name>
                <description>Enable Initiator event close interrupt.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_REQ_TX_EN</name>
                <description>Enables connection request packet transmission start interrupt.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_CREATED</name>
                <description>Enable master connection created interrupt</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INIT_CHANNEL_MAP</name>
                <description>Advertising channels that are enabled for initiator scanning operation.
Bit 15: setting 1 - enables channel 39 for use.
Bit 14: setting 1 - enables channel 38 for use.
Bit 13: setting 1 - enables channel 37 for use.</description>
                <bitRange>[15:13]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_CONFIG</name>
            <description>Connection configuration register</description>
            <addressOffset>0x1E0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xE11F</resetValue>
            <resetMask>0xF9FF</resetMask>
            <fields>
              <field>
                <name>RX_PKT_LIMIT</name>
                <description>Defines a limit for the number of Rx packets that can be re-ceived by the LLH. Default maximum value is 0xF.Minimum value shall be '1' or no packet will be stored in the Rx FIFO.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_INTR_THRESHOLD</name>
                <description>This register field allows setting a threshold for the packet received interrupt to the firmware.
For example if the value programmed is
0x2 - then HW will generate interrupt only on receiving the second packet. 
In any case if the received number of packets in a conn event is less than the threshold or there are still packets (less than threshold) pending in the Rx FIFO, HW will generate the interrupt at the ce_close.
Min value possible is 1. Max value depends on the Rx FIFO capacity.</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MD_BIT_CLEAR</name>
                <description>This register field indicates whether the MD (More Data) bit needs to be controlled by 'software' or, 'hardware and soft-ware logic combined'.
1 - MD bit is exclusively controlled by software, ie based on status of CE_CNFG_STS_REGISTER[6] - md bit.
0 - MD Bit in the transmitted pdu is controlled by software and hardware logic. MD bit is set in transmitted packet, only if the software has set the md bit in CE_CNFG_STS_REGISTER[6] and either of the following conditions is true,
a) If there are packets queued for transmission.
b) If there is an acknowledgement awaited from the remote side for the packet transmitted.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_SLOT_VARIANCE</name>
                <description>This bit configures the DSM slot counting mode.
0 - The DSM slot count variance with respect to actual time is less than 1 slot
1 - The DSM slot count variance with respect to actual time is more than 1 slot &amp;less that 2 slots</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SLV_MD_CONFIG</name>
                <description>This bit is set to configure the MD bit control when IUT is in slave role.
1 - MD bit will be decided on packet pending status
0 - MD bit will be decided on packet queued in next buffer status
This bit has effect only when 'CONN_CONFIG.md_bit_ctr' bit is not set .</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EXTEND_CU_TX_WIN</name>
                <description>This bit is used to enable/disable extending the additional rx window on slave side during connection update in event of packet miss at the update instant.
1 - Enable
0 - Disable</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MASK_SUTO_AT_UPDT</name>
                <description>This bit is used to enable/disable masking of internal hardware supervision timeout trigger when switching from old connection parameters to new parameters. 
1 - Enable
0 - Disable</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_REQ_1SLOT_EARLY</name>
                <description>This bit is used to enable extension of the Conn Request to arbiter to 1 slot early. When enabled the request length is 2 slots.
1 - Enable
0 - Disable</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_CH_TX_POWER</name>
            <description>Connection channel transmit power</description>
            <addressOffset>0x1E4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONNCH_TRANSMIT_POWER</name>
                <description>Transmit power to be used for all packets transmitted on the connection channel.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_PARAM1</name>
            <description>Connection parameter 1</description>
            <addressOffset>0x1E8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SCA_PARAM</name>
                <description>Sleep Clock Accuracy</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HOP_INCREMENT_PARAM</name>
                <description>Hop increment for connection channel.</description>
                <bitRange>[7:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CRC_INIT_L</name>
                <description>This field defines the lower byte (7:0) of the CRC initialization vector.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_PARAM2</name>
            <description>Connection parameter 2</description>
            <addressOffset>0x1EC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CRC_INIT_H</name>
                <description>This field defines the upper two bytes (23:8) of the CRC initialization vector.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_INTR_MASK</name>
            <description>Connection Interrupt mask</description>
            <addressOffset>0x1F0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC3FF</resetMask>
            <fields>
              <field>
                <name>CONN_CL_INT_EN</name>
                <description>If this bit is set connection closed interrupt is enabled.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_ESTB_INT_EN</name>
                <description>If this bit is set connection establishment interrupt is enabled.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MAP_UPDT_INT_EN</name>
                <description>If this bit is set, channel map update interrupt is enabled.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>START_CE_INT_EN</name>
                <description>If this bit is set connection event start interrupt is enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLOSE_CE_INT_EN</name>
                <description>If this bit is set connection event closed interrupt is enabled.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CE_TX_ACK_INT_EN</name>
                <description>If this bit is set transmission acknowledgement interrupt is enabled: 
This interrupt is generated to indicate to the firmware that a non-empty packet transmitted is successfully acknowledged by the remote device.
For negative acknowledgements from remote device, this interrupt indication is not generated.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CE_RX_INT_EN</name>
                <description>If this bit is set interrupt is enabled for reception of packet in a connection event.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONN_UPDATE_INTR_EN</name>
                <description>If this bit is set connection update interrupt is enabled.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_GOOD_PDU_INT_EN</name>
                <description>If this bit is set packet receive good pdu interrupt is enabled. Effective only when bit 6 is set.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_BAD_PDU_INT_EN</name>
                <description>If this bit is set packet receive bad pdu interrupt is enabled. Effective only when bit 6 is set.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PING_TIMER_EXPIRD_INTR</name>
                <description>If this bit is set ping timer expired interrupt is enabled.</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PING_NEARLY_EXPIRD_INTR</name>
                <description>If this bit is set ping timer nearly expired interrupt is enabled</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SLAVE_TIMING_CONTROL</name>
            <description>slave timing control</description>
            <addressOffset>0x1F4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xBE96</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SLAVE_TIME_SET_VAL</name>
                <description>Programmable adjust value to the clock counter when slave is connected</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SLAVE_TIME_ADJ_VAL</name>
                <description>Timing adjust value. The internal micro second counter is adjusted to this value whenever slave receives a good access address match at connection anchor point. This will ensure the slave gets synchronized to master timing.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RECEIVE_TRIG_CTRL</name>
            <description>Receive trigger control</description>
            <addressOffset>0x1F8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF3F</resetMask>
            <fields>
              <field>
                <name>ACC_TRIGGER_THRESHOLD</name>
                <description>Access address match threshold value. Number of bits of ac-cess address that should match with the expected access ad-dress to trigger an access code match. 

Max value : 32  (for 32-bit access address)
Lower values may be programmed for bad radios or channels but care must be taken to ensure there are no 'false' matches due to reduced number of bits required to match.</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACC_TRIGGER_TIMEOUT</name>
                <description>If access address match does not occur then within this time from the start of receive operation, the receive operation times out and stops.  An internal counter value of 1usec resolution is continuously compared with the value programmed.
Max value :0xFF</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DPLL_CONFIG</name>
            <description>DPLL &amp; CY Correlator configuration register</description>
            <addressOffset>0x258</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x92E0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DPLL_CORREL_CONFIG</name>
                <description>If CY_CORREL_EN is 0:
[2:0] Read pointer correction on DPLL overflow. Optimal setting is 0x4.
[6:4] Minimum distance from Rd ptr to Wr ptr to start read in DPLL. Optimal setting is 0x6.
[11:8] Sets lower water mark for DPLL. Optimal setting is 0x2.
[15:12] Sets upper water mark for DPLL. Optimal setting is 0x9.

If CY_CORREL_EN is 1:
[11:0] CY correl Access address compare mask for LSB 12 bits. Ideal value is 0xFFF
[15:12] CY correl maximum number of allowed mismatched bits in access address. Ideal value is 0x0.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WHITELIST_BASE_ADDR</name>
            <description>Whitelist base address</description>
            <addressOffset>0x340</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>WL_BASE_ADDR</name>
                <description>Device address values written to white list memory are written as 16-bit wide address.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_UPDATE_NEW_INTERVAL</name>
            <description>Connection update new interval</description>
            <addressOffset>0x3A4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_UPDT_INTERVAL</name>
                <description>This register will have the new connection interval that the hardware will use after the connection update instant. Before the instant, the connection interval in the register CONN_INTERVAL will be used by hardware.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_UPDATE_NEW_LATENCY</name>
            <description>Connection update new latency</description>
            <addressOffset>0x3A8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_UPDT_SLV_LATENCY</name>
                <description>This register will have the new slave latency parameter that the hardware will use after the connection update instant. Before the instant, the connection interval in the register SLAVE_LATENCY will be used by hardware.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_UPDATE_NEW_SUP_TO</name>
            <description>Connection update new supervision timeout</description>
            <addressOffset>0x3AC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_UPDT_SUP_TO</name>
                <description>This register will have the new supervision timeout that the hardware will use after the connection update instant. Before the instant, the connection interval in the register SUP_TIMEOUT will be used by hardware.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_UPDATE_NEW_SL_INTERVAL</name>
            <description>Connection update new Slave Latency X Conn interval Value</description>
            <addressOffset>0x3B0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SL_CONN_INTERVAL_VAL</name>
                <description>This register will have the new Slave Latency * Conn Interval value that the hardware will use after the connection update instant. Before the instant, the connection interval in the register SL_CONN_INTERVAL will be used by hardware.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
