cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
          <register>
            <name>CONN_REQ_WORD0</name>
            <description>Connection request address word 0</description>
            <addressOffset>0x3C0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ACCESS_ADDR_LOWER</name>
                <description>This field defines the lower 16 bits of the access address that is to be sent in the connect request packet of the initiator.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD1</name>
            <description>Connection request address word 1</description>
            <addressOffset>0x3C4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ACCESS_ADDR_UPPER</name>
                <description>This field defines the upper16 bits of the access address that is to be sent in the connect request packet of the initiator.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD2</name>
            <description>Connection request address word 2</description>
            <addressOffset>0x3C8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>TX_WINDOW_SIZE_VAL</name>
                <description>window_size along with the window_offset is used to calculate the first connection point anchor point for the master.
This shall be a multiple of 1.25 ms in the range of 1.25 ms to the lesser of 10 ms and (connInterval - 1.25 ms).
Values range from 0 to 10 ms.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CRC_INIT_LOWER</name>
                <description>This field defines the lower byte [7:0] of the CRC initialization value.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD3</name>
            <description>Connection request address word 3</description>
            <addressOffset>0x3CC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CRC_INIT_UPPER</name>
                <description>This field defines the upper byte [23:8] of the CRC initialization value that is to be sent in the connect request packet of the initiator.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD4</name>
            <description>Connection request address word 4</description>
            <addressOffset>0x3D0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>TX_WINDOW_OFFSET</name>
                <description>This is used to determine the anchor point for the master transmission.
Range: This shall be a multiple of 1.25 ms in the range of 0 ms to connInterval value.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD5</name>
            <description>Connection request address word 5</description>
            <addressOffset>0x3D4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONNECTION_INTERVAL_VAL</name>
                <description>The value configured in this register determines the spacing between the connection events.
This shall be a multiple of 1.25 ms in the range of 7.5 ms to 4.0 s.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD6</name>
            <description>Connection request address word 6</description>
            <addressOffset>0x3D8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SLAVE_LATENCY_VAL</name>
                <description>The value configured in this field defines the number of consecutive connection events that the slave device is not required to listen for master. The value of connSlaveLatency should not cause a Supervision Timeout. This shall be an integer in the range of                                               0 to ((connSupervision Timeout/connInterval)-1). connSlaveLatency shall also be less than 500.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD7</name>
            <description>Connection request address word 7</description>
            <addressOffset>0x3DC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SUPERVISION_TIMEOUT_VAL</name>
                <description>This field defines the maximum time between two received Data packet PDUs before the connection is considered lost.
This shall be a multiple of 10 ms in the range of 100 ms to 32.0 s and it shall be larger than (1+connSlaveLatency)*connInterval.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD8</name>
            <description>Connection request address word 8</description>
            <addressOffset>0x3E0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA_CHANNELS_LOWER</name>
                <description>This register field indicates which of the data channels are in use. This stores the information for the lower 16 (15:0) data channel indices.
1' indicates the corresponding data channel is used and '0' indicates the channel is unused.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD9</name>
            <description>Connection request address word 9</description>
            <addressOffset>0x3E4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA_CHANNELS_MID</name>
                <description>This register field indicates which of the data channels are in use. This stores the information for the middle 16 (31:16) data channel indices.
'1' indicates the corresponding data channel is used and '0' indicates the channel is unused.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD10</name>
            <description>Connection request address word 10</description>
            <addressOffset>0x3E8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F</resetMask>
            <fields>
              <field>
                <name>DATA_CHANNELS_UPPER</name>
                <description>This register field indicates which of the data channels are in use. This stores the information for the upper 5 (36:32) data channel indices.
'1' indicates the corresponding data channel is used and '0' indicates the channel is unused.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_REQ_WORD11</name>
            <description>Connection request address word 11</description>
            <addressOffset>0x3EC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>HOP_INCREMENT_2</name>
                <description>This field is used for the data channel selection process.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCA_2</name>
                <description>This field defines the sleep clock accuracies given in ppm.</description>
                <bitRange>[7:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKET_COUNTER0</name>
            <description>Packet counter 0</description>
            <addressOffset>0x400</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PACKET_COUNTER_LOWER</name>
                <description>Lower 16-bits of the packet counter value passed as part of Nonce for the packet to be encrypted.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKET_COUNTER1</name>
            <description>Packet counter 1</description>
            <addressOffset>0x404</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PACKET_COUNTER_MIDDLE</name>
                <description>Middle 16-bits of the packet counter value passed as part of Nonce for the packet to be encrypted.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKET_COUNTER2</name>
            <description>Packet counter 2</description>
            <addressOffset>0x408</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>PACKET_COUNTER_UPPER</name>
                <description>Upper 8 bits of the packet counter value passed as part of Nonce for the packet to be encrypted.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IV_MASTER0</name>
            <description>Master Initialization Vector 0</description>
            <addressOffset>0x410</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>IV_MASTER_LOWER</name>
                <description>This is the lower 16-bits of the IVm field, which contains the master's portion of the initialization vector.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IV_MASTER1</name>
            <description>Master Initialization Vector 1</description>
            <addressOffset>0x414</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>IV_MASTER_UPPER</name>
                <description>This is the upper 16-bits of the IVm field, which contains the master's portion of the initialization vector.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IV_SLAVE0</name>
            <description>Slave Initialization Vector 0</description>
            <addressOffset>0x418</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>IV_SLAVE_LOWER</name>
                <description>This is the lower 16-bits of the IVs field, which contains the slave's portion of the initialization vector.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IV_SLAVE1</name>
            <description>Slave Initialization Vector 1</description>
            <addressOffset>0x41C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>IV_SLAVE_UPPER</name>
                <description>This is the upper 16-bits of the IVs field, which contains the slave's portion of the initialization vector.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>4</dimIncrement>
            <name>ENC_KEY[%s]</name>
            <description>Encryption Key register 0-7</description>
            <addressOffset>0x420</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ENC_KEY</name>
                <description>The encryption key / session key which is used in ECB encryption, CCM encryption and CCM decryption.</description>
                <bitRange>[15:0]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA0</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x440</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Write: Bytes 1 and 0 of the input plain text to be encrypted.
Read: Bytes 1 and 0 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA1</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x444</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA1</name>
                <description>Write: Bytes 3 and 2 of the input plain text to be encrypted.
Read: Bytes 3 and 2 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA2</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x448</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA2</name>
                <description>Write: Bytes 5 and 4 of the input plain text to be encrypted.
Read: Bytes 5 and 4 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA3</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x44C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA3</name>
                <description>Write: Bytes 7 and 6 of the input plain text to be encrypted.
Read: Bytes 7 and 6 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA4</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x450</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA4</name>
                <description>Write: Bytes 9 and 8 of the input plain text to be encrypted.
Read: Bytes 9 and 8 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA5</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x454</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA5</name>
                <description>Write: Bytes 11 and 10 of the input plain text to be encrypted.
Read: Bytes 11 and 10 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA6</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x458</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA6</name>
                <description>Write: Bytes 13 and 12 of the input plain text to be encrypted.
Read: Bytes 13 and 12 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA7</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x45C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA7</name>
                <description>Write: Bytes 15 and 14 of the input plain text to be encrypted.
Read: Bytes 15 and 14 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA8</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x460</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA8</name>
                <description>Write: Bytes 17 and 16 of the input plain text to be encrypted.
Read: Bytes 17 and 16 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA9</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x464</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA9</name>
                <description>Write: Bytes 19 and 18 of the input plain text to be encrypted.
Read: Bytes 19 and 18 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
