cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
          <register>
            <name>DATA10</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x468</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA10</name>
                <description>Write: Bytes 21 and 20 of the input plain text to be encrypted.
Read: Bytes 21 and 20 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA11</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x46C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA11</name>
                <description>Write: Bytes 23 and 22 of the input plain text to be encrypted.
Read: Bytes 23 and 22 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA12</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x470</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DATA12</name>
                <description>Write: Bytes 25 and 24 of the input plain text to be encrypted.
Read: Bytes 25 and 24 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA13</name>
            <description>Input / Output Data register</description>
            <addressOffset>0x474</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>DATA13</name>
                <description>Write: Byte 26 of the input plain text to be encrypted.
Read: Byte 26 of the decrypted plain text/ encrypted text.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MIC_IN0</name>
            <description>MIC input register</description>
            <addressOffset>0x478</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>MIC_IN_LOWER</name>
                <description>This is the lower 16-bits of the MIC field used for CCM decryption.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MIC_IN1</name>
            <description>MIC input register</description>
            <addressOffset>0x47C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>MIC_IN_UPPER</name>
                <description>This is the upper 16-bits of the MIC field used for CCM decryption.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MIC_OUT0</name>
            <description>MIC output register</description>
            <addressOffset>0x480</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>MIC_OUT_LOWER</name>
                <description>This is the lower 16-bits of the MIC generated during CCM encryption.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MIC_OUT1</name>
            <description>MIC output register</description>
            <addressOffset>0x484</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>MIC_OUT_UPPER</name>
                <description>This is the lower 16-bits of the MIC generated during CCM encryption.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENC_PARAMS</name>
            <description>Encryption Parameter register</description>
            <addressOffset>0x488</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>DATA_PDU_HEADER</name>
                <description>LLID of the packet.</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PAYLOAD_LENGTH</name>
                <description>Length of the input data.</description>
                <bitRange>[6:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIRECTION</name>
                <description>The directionBit shall be set to '1' for Data Channel PDUs sent by the master and set to '0' for Data Channel PDUs sent by the slave.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENC_CONFIG</name>
            <description>Encryption Configuration</description>
            <addressOffset>0x490</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>START_PROC</name>
                <description>1 Start the AES processing</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ECB_CCM</name>
                <description>0 - CCM
1 - ECB</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DEC_ENC</name>
                <description>Decryption/Encryption
0 - Encrypt
1 - Decrypt</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENC_INTR_EN</name>
            <description>Encryption Interrupt enable</description>
            <addressOffset>0x498</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>AUTH_PASS_INTR_EN</name>
                <description>Authentication interrupt enable
0 - Disable
1 - Enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ECB_PROC_INTR_EN</name>
                <description>ECB processed interrupt enable
0 - Disable
1 - Enable</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CCM_PROC_INTR_EN</name>
                <description>CCM processed interupt enable
0 - Disable
1 - Enable</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENC_INTR</name>
            <description>Encryption Interrupt status and clear register</description>
            <addressOffset>0x4A0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>AUTH_PASS_INTR</name>
                <description>Authentication interrupt.
0x1- indicates MIC matched
0x0 -indicated MIC mismatched
Writing 1 to this register clears the interrupt.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ECB_PROC_INTR</name>
                <description>ECB processed interrupt.
Writing 1 to this register clears the interrupt.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CCM_PROC_INTR</name>
                <description>CCM processed interrupt.
Writing 1 to this register clears the interrupt</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DATA_CLEAR</name>
                <description>Clears the input data. Used for Zero padding of encryption for less than block sized data.</description>
                <bitRange>[3:3]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_TXMEM_BASE_ADDR</name>
            <description>Connection TX memory base address</description>
            <addressOffset>0x600</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_TX_MEM_BASE_ADDR</name>
                <description>Data values written to Tx memory are written as 16-bit wide data.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_RXMEM_BASE_ADDR</name>
            <description>Connection RX memory base address</description>
            <addressOffset>0x800</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_RX_MEM_BASE_ADDR</name>
                <description>Data values written to Rx memory are written as 16-bit wide data</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PDU_RESP_TIMER</name>
            <description>PDU response timer</description>
            <addressOffset>0xA04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>PDU_RESP_TIME_VAL</name>
                <description>This register is loaded with the count value to monitor the time to get a response for a PDU from peer device.
Firmware starts the timer by issuing the command, RESP_TIMER_ON, after it has queued a PDU for transmission, that requires a response. 
If a response is received, firmware stops and clears the timer by issuing the command RESP_TIMER_OFF.
If this timer expires, it results in hardware closing the connection and triggering a conn_closed interrupt.
The discon_status field in the Connection status register is set with the appropriate reason.
Units : Milliseconds.
Resolution : 1.25 ms</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NEXT_RESP_TIMER_EXP</name>
            <description>Next response timeout instant</description>
            <addressOffset>0xA08</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>NEXT_RESPONSE_INSTANT</name>
                <description>This field defines the clock instant at which the next PDU response timeout event will occur on a connection.
This is with reference to the 16-bit internal reference clock.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NEXT_SUP_TO</name>
            <description>Next supervision timeout instant</description>
            <addressOffset>0xA0C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>NEXT_TIMEOUT_INSTANT</name>
                <description>This field defines the clock instant at which the next connection supervision timeout event will occur on a connection
This is with reference to the 16-bit internal reference clock.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LLH_FEATURE_CONFIG</name>
            <description>Feature enable</description>
            <addressOffset>0xA10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x2</resetValue>
            <resetMask>0x3</resetMask>
            <fields>
              <field>
                <name>QUICK_TRANSMIT</name>
                <description>Quick transmit feature in slave latency is enabled by setting this bit.
When slave latency is enabled, this feature enables the slave to transmit in the immediate connection interval,  in case required, instead of waiting till the end of slave latency</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SL_DSM_EN</name>
                <description>Enable/Disable Slave Latency Period DSM.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WIN_MIN_STEP_SIZE</name>
            <description>Window minimum step size</description>
            <addressOffset>0xA14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x2064</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>STEPDN</name>
                <description>After receiving 2 consecutive good packets the reference window is gradually decremented by step down size until it reaches window minimum. The unit is in microseconds</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>STEPUP</name>
                <description>If packets are missed, the reference window is gradually increased by step up size, until it receives 2 consecutive good packets. The unit is in microseconds</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WINDOW_MIN_FW</name>
                <description>Minimum window interval value programmed by firmware. While the slave receive window is decremented, the windows_min_fw sets the lowest value of the window widen value to ensure packets are not missed. The unit is in microseconds.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SLV_WIN_ADJ</name>
            <description>Slave window adjustment</description>
            <addressOffset>0xA18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x10</resetValue>
            <resetMask>0x7FF</resetMask>
            <fields>
              <field>
                <name>SLV_WIN_ADJ</name>
                <description>Window Adjust value. This value is added to the calculated slave window widening value to be used as final window widen value.</description>
                <bitRange>[10:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SL_CONN_INTERVAL</name>
            <description>Slave Latency X Conn Interval Value</description>
            <addressOffset>0xA1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SL_CONN_INTERVAL_VAL</name>
                <description>This field defines the (SL*CI) product for the ongoing connection. This value is used in calculation of next connection instant during slave latency.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LE_PING_TIMER_ADDR</name>
            <description>LE Ping connection timer address</description>
            <addressOffset>0xA20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_PING_TIMER_ADDR</name>
                <description>The register used to configure the LE Au-thenticated payload Timeout (LE APTO) which is the Maximum amount of time specified between packets authenticated by a MIC.
This value of ping timer is in the order of 10ms, valid range 0x1 ~ 0xFFFF</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LE_PING_TIMER_OFFSET</name>
            <description>LE Ping connection timer offset</description>
            <addressOffset>0xA24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_PING_TIMER_OFFSET</name>
                <description>The value of ping timer nearly expired offset in the order of 10ms, valid range 0x0 ~ 0xFFFF. This is the time period after which the ping timer nearly expired interrupt is generated.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LE_PING_TIMER_NEXT_EXP</name>
            <description>LE Ping timer next expiry instant</description>
            <addressOffset>0xA28</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_PING_TIMER_NEXT_EXP</name>
                <description>The value of ping timer next expiry instant in the terms of native clock value (least 16 bit value of the 17 bit ping counter).
 This together with CONN_PING_TIMER_NEXT_EXP_WRAP will provide the correct status of ping timer duration.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LE_PING_TIMER_WRAP_COUNT</name>
            <description>LE Ping Timer wrap count</description>
            <addressOffset>0xA2C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONN_SEC_CURRENT_WRAP</name>
                <description>This register holds the current position of the Ping timer.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_EN_EXT_DELAY</name>
            <description>Transmit enable extension delay</description>
            <addressOffset>0xE00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x5</resetValue>
            <resetMask>0x1F</resetMask>
            <fields>
              <field>
                <name>TXEN_EXT_DELAY</name>
                <description>Transmit enable extension delay. This is to extend the active state (high) of rif_tx_en signal after the last bit is sent out from LLH. The unit is in microsecond and the supported range is 00 - 31 us.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
