cmsis-svd/cmsis-svd/data/Infineon/psoc4200bl.svd
          <register>
            <name>TX_RX_SYNTH_DELAY</name>
            <description>Transmit/Receive enable delay</description>
            <addressOffset>0xE04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RX_EN_DELAY</name>
                <description>The delay used to assert rif_rx_en, Rx_tRamp micro-seconds, ahead of first bit of the expected rx_data, which can be used to turn on the Radio receiver.
The value to be programmed to the Rx_en_delay [7:0] = rx_on_delay - Rx_tRamp
rx_on_delay[7:0] = TX_RX_ON_DELAY[7:0])
Rx_tRamp = Radio receiver rampup time</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_EN_DELAY</name>
                <description>The delay used to assert rif_tx_en exactly Tx_tRamp micro-seconds ahead of the first bit of the tx_data, which can be used to turn on the Radio transmitter.
The value to be programmed to the Tx_en_delay [7:0] = tx_on_delay - Tx_tRamp
tx_on_delay[7:0] = TX_RX_ON_DELAY[15:8])
Tx_tRamp = Radio transmitter ramp_up</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>BLESS</name>
          <description>Bluetooth Low Energy Subsystem Miscellaneous</description>
          <addressOffset>0x0000F000</addressOffset>
          <register>
            <name>WCO_CONFIG</name>
            <description>WCO Configuration Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x470002</resetValue>
            <resetMask>0x80FF0007</resetMask>
            <fields>
              <field>
                <name>LPM_EN</name>
                <description>Force block into Low Power Mode:
0: Do not force low power mode (LPM) on
1: Force low power mode (LPM) on</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LPM_AUTO</name>
                <description>Automatically control low power mode (only relevant when LPM_EN=0):
0: Do not enter low power mode (LPM) in DeepSleep
1: Enter low power mode (LPM) in DeepSleep
This bit is not functional and should be set to 0,
While entering System Deepsleep Mode, do the following before executing WFI
IOW BLESS.WCO_TRIM.XGM = 3'b010
IOW BLESS.WCO_TRIM.LPM_GM = 2'b10
IOW BLESS.WCO_CONFIG.LPM_EN = 1'b1
While existing from System Deepsleep Mode, do the following before executing ISR
IOW BLESS.WCO_CONFIG.LPM_EN = 1'b0
IOW BLESS.WCO_TRIM.XGM = 3'b001
IOW BLESS.WCO_TRIM.LPM_GM = 2'b01</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EXT_INPUT_EN</name>
                <description>Disables the load resistor and allows external clock input for pad_xin</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENBUS</name>
                <description>Test Mode Control bits
enbus[7] - N/A
enbus[6] - 1=enable both primary Beta Multipliers
enbus[5] - N/A
enbus[4] - 1=enable digital oscillator detect
enbus[3] - Load Resistor Control
enbus[2] - Load Resistor Control
enbus[1] - Load Resistor Control
enbus[0] - Load Resistor Control</description>
                <bitRange>[23:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Master enable for WCO oscillator</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WCO_STATUS</name>
            <description>WCO Status Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>OUT_BLNK_A</name>
                <description>Indicates that WCO clock has transitioned- This bit is intended for Test Mode Only and is not a reliable indicator.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RF_CONFIG</name>
            <description>Radio configuration register</description>
            <addressOffset>0x60</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xCFF1</resetMask>
            <fields>
              <field>
                <name>RF_ENABLE</name>
                <description>Enables the RF oscillator band gap.
1: band gap is enabled
0: band gap is disabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DDFT_MUX_CFG1</name>
                <description>dbg_mux_pin1 selection, combine with BLERD and BLESS
4'h0 dbg_pin_mux_1_rd (RD output)
4'h1 rxclk (RD output)
4'h2 bpktctl_to_rd (RD input)
4'h3 dbus_rx_en (llh_cy_asic output)
4'h4 hw_clk_en (pwr_ctrl_top)
4'h5 clk_switch_to_sysclk (pwr_ctrl_top)
4'h6 ll_clk_en_sync (LL global clock enable from BLESS reg synced)
4'h7 dsm_entry_stat (llh_cy_asic output)
4'h8 ll_dsm_xo_on (LL in DSM, RD XO enabled)
4'h9 ll_dsm_xo_off (LL in DSM, RD XO disabled)
4'hf  delayed_bg_en (m0s8bless_misc_dpslp_top output vs LS to s8blerf)</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DDFT_MUX_CFG2</name>
                <description>dbg_mux_pin2 selection, combine with BLERD and BLESS
4'h0 dbg_pin_mux_2_rd
4'h1 rxdata (RD output)
4'b2 ll_decode_rx_data (llh_cy_asic output)
4'h3 dbus_tx_en (llh_cy_asic output)
4'h4 fw_clk_en (pwr_ctrl_top output)
4'h5 interrupt_ll_n (llh_cy_asic output)
4'h6 ll_st_sm (llh is in SM )
4'h7 ll_st_dsm (llh is in DSM)
4'he clk_gate_en_xtal (RD eco xtal clock gater enable)
4'hf bb_xo_amp_detect_dft_mux (RD output)</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BPKTCTL_FW</name>
                <description>FW drives BLERD bpktctl if this register bit 15 enabled</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BPKTCTL_FW_DRIVE</name>
                <description>Enabled FW drives BLERD bpkctl for radio standalone testing</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>XTAL_CLK_DIV_CONFIG</name>
            <description>Crystal clock divider configuration register</description>
            <addressOffset>0x64</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>SYSCLK_DIV</name>
                <description>System clock pre-divider value. The 24 MHz crystal clock is divided to generate the system clock.
0: NO_DIV:   SYSCLK= XTALCLK/1
1: DIV_BY_2: SYSCLK= XTALCLK/2
2: DIV_BY_4: SYSCLK= XTALCLK/4
3: DIV_BY_8: SYSCLK= XTALCLK/8</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LLCLK_DIV</name>
                <description>Link Layer clock pre-divider value. The 24 MHz crystal clock is divided to generate the Link Layer clock.
0: NO_DIV:   LLCLK= XTALCLK/1
1: DIV_BY_2: LLCLK= XTALCLK/2
2: DIV_BY_4: LLCLK= XTALCLK/4
3: DIV_BY_8: LLCLK= XTALCLK/8</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DSM_INTR_STAT</name>
            <description>Link Layer interrupt status register</description>
            <addressOffset>0x68</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x103</resetMask>
            <fields>
              <field>
                <name>DSM_ENTERED_INTR</name>
                <description>On a firmware request to LL to enter into state machine, working on LF clock, LL transitions into Deep Sleep Mode and asserts this interrupt. The interrupt can be cleared by writing one into this location.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_EXITED_INTR</name>
                <description>On a firmware request to LL to exit from Deep Sleep Mode, working on LF clock, LL transitions from Deep Sleep Mode and asserts this interrupt when the Deep Sleep clock gater is turned ON. The interrupt can be cleared by writing one into this location.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XTAL_ON_INTR</name>
                <description>enabled crystal stable signal rising edge interrupt. The interrupt can be cleared by writing one into this location.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_DSM_CTRL</name>
            <description>Link Layer state machine control register</description>
            <addressOffset>0x6C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xE</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>DSM_EXIT</name>
                <description>When the Link Layer is in Deep Sleep Mode, firmware can set this bit to wake the Link Layer.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_ENTERED_INTR_MASK</name>
                <description>Masks the DSM Entered Interrupt, when disabled.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_EXITED_INTR_MASK</name>
                <description>Masks the DSM Exited Interrupt, when disabled.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XTAL_ON_INTR_MASK</name>
                <description>Masks the Crystal Stable Interrupt, when disabled.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LL_CLK_EN</name>
            <description>Link Layer primary clock enable</description>
            <addressOffset>0x70</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x2</resetValue>
            <resetMask>0x3</resetMask>
            <fields>
              <field>
                <name>CLK_EN</name>
                <description>Set this bit 1 to enable the clock to Link Layer.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CY_CORREL_EN</name>
                <description>Set this bit 1 to enable Cypress Correlator logic to bypass MT logic</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LF_CLK_CTRL</name>
            <description>BLESS LF clock control</description>
            <addressOffset>0x74</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>DISABLE_LF_CLK</name>
                <description>When set to 1, gates the LF clock input to the Link Layer. Ths is done for extended DSM mode where the DSM state machine needs to be forzen to prevent a default auto exit.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WCO_TRIM</name>
            <description>WCO Trim Register</description>
            <addressOffset>0xF00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x11</resetValue>
            <resetMask>0x37</resetMask>
            <fields>
              <field>
                <name>XGM</name>
                <description>Amplifier GM setting
0x0 - 3370 nA
0x1 - 2620 nA
0x2 - 2250 nA
0x3 - 1500 nA
0x4 - 1870 nA
0x5 - 1120 nA
0x6 -  750 nA
0x7 -      0 nA</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LPM_GM</name>
                <description>GM setting for LPM (bandwidth = DC/ms)</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
